$(document).ready(function() {
    fiveLetters = ["ЗДЕСЬ", "ЧТОБЫ", "КОГДА", "МОЖЕТ", "ОЧЕНЬ", "БУДЕТ", "ЭТОГО", "ДАВАЙ", "НУЖНО", "ЛАДНО", "ВРЕМЯ", "ДУМАЮ", "ТОГДА", "ТОБОЙ", "ЛУЧШЕ", "МОЖНО", "МНОГО", "ТАКОЙ", "ВСЕГО", "ХОТЕЛ", "ЖИЗНЬ", "ПОТОМ", "ЧЕРЕЗ", "ТАКОЕ", "ПОСЛЕ", "ЗАЧЕМ", "НИКТО", "ЖИЗНИ", "НАЗАД", "ВИДЕЛ", "ТОЧНО", "ЛЮБЛЮ", "КАКОЙ", "ЛЮДЕЙ", "ДОМОЙ", "СКАЖИ", "ПРОШУ", "БУДЕМ", "СНОВА", "МЕСТО", "МОЖЕМ", "ПОШЛИ", "ХОЧЕТ", "РАЗВЕ", "ПРЯМО", "СВОЕЙ", "ДУМАЛ", "ЗНАТЬ", "ПОНЯЛ", "ЗНАЕТ", "НАЙТИ", "МОЕГО", "БУДУТ", "СТОИТ", "ЗОВУТ", "ПЕРЕД", "НУЖЕН", "ВЕРНО", "СКОРО", "ПУСТЬ", "БОЛЕЕ", "ТАКАЯ", "НУЖНА", "ТАКИЕ", "КАКАЯ", "САМОМ", "РАВНО", "МИНУТ", "ТВОЕЙ", "МОГЛИ", "ПОЧТИ", "МОГУТ", "СОБОЙ", "СКАЖУ", "ПЛОХО", "ДВЕРЬ", "ДАВНО", "ДЕНЕГ", "ГЛАЗА", "БУДТО", "МЕЖДУ", "ПОЙДУ", "ОПЯТЬ", "САМОЕ", "ДЕТЕЙ", "ЭТОМУ", "ГОТОВ", "НОМЕР", "СВОИХ", "РЯДОМ", "УБИТЬ", "ТАКИМ", "МЕСТЕ", "ДОЛГО", "КРОМЕ", "НАШЕЙ", "ВЧЕРА", "ДРУГА", "НУЖНЫ", "КАКИЕ", "СМОГУ", "МОЕМУ", "СРАЗУ", "СВОИМ", "МОГЛА", "ВРОДЕ", "ОДНОЙ", "ВЕЧЕР", "ВЗЯТЬ", "СЛОВА", "ВАЖНО", "ПОМНЮ", "НОЧЬЮ", "УТРОМ", "БОЮСЬ", "ТАКЖЕ", "ВАШЕЙ", "САМЫЙ", "СПАТЬ", "СТАТЬ", "ПОЙТИ", "ИНАЧЕ", "СЛОВО", "НОВЫЙ", "ЧАСОВ", "ЗНАЕМ", "КОНЕЦ", "ПРАВА", "ГОРОД", "ПАРНИ", "ЗНАЛА", "НАШЛИ", "ПОШЕЛ", "ИМЕЕТ", "НАШИХ", "ЧАСТЬ", "ХОТЯТ", "ЧУВАК", "ДАЙТЕ", "ЖДАТЬ", "ЗАТЕМ", "ЛЮБИТ", "ТАКИХ", "РЕШИЛ", "НАШЕЛ", "МЕСТА", "ПАРНЯ", "ВДРУГ", "МАДАМ", "КАКОЕ", "ФИЛЬМ", "КРОВЬ", "ИДИТЕ", "ДЕРЖИ", "ЗАБЫЛ", "ПОЗЖЕ", "МИЛАЯ", "ТЫСЯЧ", "ДЕЛАЛ", "КОНЦЕ", "МИЛЫЙ", "ДОБРО", "ЛЮБВИ", "ЧЕСТЬ", "ЧАРЛИ", "ДЕЛАЮ", "ШЕСТЬ", "ЧАСТО", "ЗНАЮТ", "СЕМЬЯ", "УХОДИ", "ТВОИХ", "ОКОЛО", "ЛЕГКО", "ДЕЛАЙ", "ХОТИМ", "ИМЕТЬ", "ШКОЛЕ", "МАЛЫШ", "ШКОЛУ", "СЫНОК", "СТАЛО", "ЗНАЛИ", "ВЫЙТИ", "ЛЮДЯМ", "ОГОНЬ", "ДЕТКА", "СРЕДИ", "ТВОИМ", "МУЖИК", "ОТВЕТ", "ЛЮБОЙ", "ИМЕНИ", "УЛИЦЕ", "УБИЛИ", "ВАШИХ", "ЕХАТЬ", "КРОВИ", "ГОЛОС", "МЕСЯЦ", "САМАЯ", "КОНЦА", "ИДИОТ", "УЗНАЛ", "ВСЕМУ", "ТАКОМ", "УДАЧИ", "СЕМЬИ", "ГАРРИ", "ВОЙНА", "ПРАВО", "ТАКУЮ", "ВОЙНЫ", "СТАЛА", "СТАЛИ", "СЛЫШУ", "НАЧАЛ", "ВЕСТИ", "НАШЛА", "ЗЕМЛЕ", "ФРЭНК", "СВЯЗИ", "ПОШЁЛ", "РУКАХ", "ОДНИМ", "БРОСЬ", "БРАТА", "КРУТО", "ПОКОЕ", "ЗЕМЛЮ", "ЖИВЕТ", "ЛЮБОМ", "СЛАВА", "ЗАМУЖ", "ПОХОЖ", "ЗЕМЛИ", "ВЫБОР", "МЕСЬЕ", "ДЭВИД", "РАДИО", "ПОШЛА", "ЛЮБИЛ", "КАКИМ", "НОВЫЕ", "САМОЙ", "ВСЕМИ", "ШКОЛЫ", "ВАШИМ", "ДВЕРИ", "ВИДНО", "ВЗЯЛИ", "ОТЦОМ", "НИКАК", "НАЙДУ", "НОВАЯ", "СВОЕМ", "МАЙКЛ", "АЛЕКС", "ДРУГУ", "МЫСЛИ", "СУКИН", "СВЕТЕ", "НАРОД", "ОДНОМ", "ВНИЗУ", "ОБЩЕМ", "ВОВСЕ", "ТАКСИ", "ЧЕРТА", "БЛЯДЬ", "ОТДАЙ", "НАШЁЛ", "КУПИЛ", "ЧАСТИ", "КАКУЮ", "НАШИМ", "ЭТИМИ", "ЦЕЛЫЙ", "ВЕЧНО", "ПОЕЗД", "НИЧТО", "ВАШЕМ", "ВВЕРХ", "СВЯЗЬ", "КНИГИ", "ЖЕНОЙ", "МЕРТВ", "ПИТЕР", "ПОПАЛ", "КЛЮЧИ", "КАКОМ", "МОГЛО", "НАШЕМ", "БЛИЖЕ", "ЗАНЯТ", "ВВИДУ", "СМЫСЛ", "НОВОЕ", "ЛИЧНО", "УСТАЛ", "МЕНЕЕ", "САМЫЕ", "КНИГУ", "УХОЖУ", "НОВУЮ", "ВЫХОД", "СТАНУ", "ВЫШЕЛ", "БИЛЛИ", "НЕЧТО", "СЕМЬЮ", "АДРЕС", "ДУРАК", "СВЕТА", "БОЙСЯ", "ЗЕМЛЯ", "СЕМЬЕ", "ВЕЗДЕ", "ГЛУПО", "ТВОЕМ", "ЛЮБЯТ", "ПРОЧЬ", "ИДЕШЬ", "КЛАСС", "ДЖЕЙН", "ВЕЩЕЙ", "ПОЛНО", "ГЕНРИ", "ЧЕРТУ", "СОВЕТ", "ЗАКОН", "МЫСЛЬ", "АГЕНТ", "УБЕРИ", "ПОЕДУ", "ВОЙТИ", "ДОЖДЬ", "ДЭННИ", "КНИГА", "ВЫШЛА", "ПЕСНЯ", "ВЗЯЛА", "БОББИ", "ПРАВЫ", "ИИСУС", "ЛЕГЧЕ", "МАРИЯ", "САМЫХ", "ДУМАЙ", "БЕЛЫЙ", "КУРСЕ", "СНЯТЬ", "ШУТКА", "НОВОЙ", "АРМИИ", "ЗАПАХ", "НАЙДИ", "ХОРОШ", "ДЖЕЙК", "ПЛАНЫ", "ОБОИХ", "ЦВЕТЫ", "ВОЙНУ", "КАКИХ", "ЦЕНТР", "УЕХАЛ", "ВЫШЛО", "ПРИДУ", "ШТУКА", "САМЫМ", "ПЕСНЮ", "УВИЖУ", "ИГРАЛ", "БЕЖИМ", "СТОЛЬ", "МАМОЙ", "ЖЕЛАЮ", "ЧИСТО", "МОЗГИ", "КУСОК", "РЕБЯТ", "ТОММИ", "УКРАЛ", "БИЛЕТ", "БОЛИТ", "ВЕТЕР", "ЖИВУТ", "ПРИЕМ", "ДЕЛОМ", "ИСКАЛ", "ЗВАЛИ", "ВИДИТ", "ГОСТИ", "ГЕРОЙ", "ВНОВЬ", "ДЕРЖУ", "ОТЕЛЬ", "БРАТЬ", "СЗАДИ", "ХРЕНА", "АМИНЬ", "ВОЗЛЕ", "УЛИЦУ", "СИДИТ", "ЧИТАЛ", "ЖИВОЙ", "ЛИЦОМ", "ПОГИБ", "АРТУР", "КАРТЫ", "ЖИВЁТ", "ЗАЙТИ", "СОТНИ", "СТРАХ", "БОГОМ", "МЕЧТЫ", "СУДЬЯ", "ДВУМЯ", "ПОМОГ", "ШЛЮХА", "ШКОЛА", "ДВОИХ", "ВОЙНЕ", "ПАРИЖ", "УМЕЕТ", "СВОЁМ", "ПРОЩЕ", "УЗНАЮ", "ЦЕЛУЮ", "МАЙОР", "БРАВО", "НИЧЕМ", "СИДЕЛ", "НОВЫХ", "ЙОРКЕ", "ЛЕЖИТ", "ФОРМЕ", "ЗАМОК", "ГРУДЬ", "МАРТИ", "ЛИНИИ", "РУКОЙ", "АРМИЯ", "ШТАНЫ", "УБЬЮТ", "ИМЕЮТ", "СЕСТЬ", "ИСЧЕЗ", "ИМЕНА", "ПРИНЦ", "ДЕТЯМ", "ЛЮБОЕ", "УБИЛА", "МОИМИ", "ЛАРРИ", "СУПЕР", "БОЛЕН", "ПОМНИ", "ОТДАЛ", "ХОДИЛ", "СПИШЬ", "СНИМИ", "ПЕСНИ", "КОСТИ", "ЦВЕТА", "МЁРТВ", "ВИСКИ", "УЛИЦЫ", "УМНЫЙ", "ИГРАЮ", "ВЕДЕТ", "ЖЕНАТ", "ТОМАС", "СОШЕЛ", "МУЖЕМ", "СТРИТ", "ПАЛЕЦ", "МЕЧТА", "ЖИВЫХ", "СЫНОМ", "ТОЧКИ", "СТЕНЫ", "ВИДИМ", "ТЕРРИ", "ОТДАМ", "СХОЖУ", "ВЫЙДУ", "РОВНО", "СТОЯТ", "ЛЮБИМ", "ЖАРКО", "НОВЫМ", "КЕВИН", "ЖДАЛИ", "АНГЕЛ", "СЛУХИ", "ОТДЕЛ", "ГЕНИЙ", "ТВОЁМ", "УМРЕТ", "ПЛАЧУ", "РАНЕН", "ЖДАЛА", "ПУСТИ", "ОТЕЛЕ", "ШЕРИФ", "РОМАН", "ПИСАЛ", "ИМЕЕМ", "СПАЛА", "КУПЛЮ", "ХОДИТ", "ИЩЕШЬ", "ХОДЯТ", "СЛЕДЫ", "СЛЕВА", "СУМКУ", "ГОРЛО", "МИРОМ", "СТЕНЕ", "ВИЛЛИ", "БОМБА", "СОРОК", "НИГДЕ", "ЗВОНИ", "УБЬЕТ", "ТОВАР", "КНИГЕ", "КАРТУ", "ВОДОЙ", "СЦЕНУ", "МАРТА", "ПАПОЙ", "ОФИСЕ", "ЛЮБУЮ", "ДОМОМ", "МОЗГА", "ВРАЧА", "СИЛОЙ", "КУХНЕ", "СПИНУ", "ИМЕЛА", "ПОЙМИ", "ЧИСЛО", "СОБАК", "КЛУБЕ", "ЭМИЛИ", "ЕДЕШЬ", "СТОЯЛ", "САМУЮ", "ДАЛЕЕ", "СЕКСА", "СТОЛЕ", "ВИДЕО", "БОРТУ", "ВЕРНИ", "ГРУДИ", "ПИШЕТ", "СЧЕТА", "СЛЕДИ", "ОСОБО", "ДЖОНА", "ТУПОЙ", "ФОРМУ", "ЗВОНЮ", "ВЫПЕЙ", "ЛЕТОМ", "ЦЕЛЬЮ", "ЙОРКА", "БЭРРИ", "ЖАЛКО", "ДВОРЕ", "СКОТТ", "БЕТТИ", "ЕВРЕЙ", "ВЫШЛИ", "ЛЕВОЙ", "АВТОР", "СТИЛЬ", "СЦЕНЕ", "ВОЛОС", "ГЛАВА", "ЧЁРТА", "ТОЧКА", "САЛЛИ", "АРМИЮ", "ЖДИТЕ", "ПИРОГ", "УСПЕЛ", "ВЫЗОВ", "РАЗУМ", "БЕЛЫЕ", "ЖИВОТ", "ШТУКУ", "ЖИВЕМ", "ПТИЦА", "КАРТА", "ПЛАЧЬ", "ВЫРОС", "ГРЕЙС", "СОШЛА", "ЗВАТЬ", "СТЕНУ", "ВЕРИТ", "УСПЕХ", "СЕВЕР", "ЕЗЖАЙ", "ЖИВЫМ", "ИДЁШЬ", "ДЖОНС", "ЗАКАЗ", "ШОССЕ", "БЕГОМ", "ПРИЁМ", "БАНКА", "ПАРКЕ", "ИТОГЕ", "ЯЗЫКЕ", "МАШИН", "ДРЯНЬ", "КАМНИ", "ВЗРЫВ", "СУЧКА", "ОБЕДА", "ДЖУЛИ", "ЛЮДЯХ", "МЭГГИ", "ТАНЕЦ", "ВЕРНУ", "ПАРНЮ", "ВРАТЬ", "ТУФЛИ", "НАЧНУ", "ДОБРЫ", "ХРЕНЬ", "ВИДЯТ", "ПОЖАР", "ПОШЛО", "ХВОСТ", "ЭТАЖЕ", "РЕДКО", "ЦЕЛАЯ", "ВЕЩАХ", "БЛЯТЬ", "СИЛАХ", "ШТАТА", "ТЕПЛО", "МОЛЧИ", "ТВАРЬ", "ГОРИТ", "МУСОР", "ТОКИО", "ПОЙМУ", "ТОЛПА", "ПУШКУ", "САНТА", "ФУТОВ", "ШТУКИ", "КЕЛЛИ", "СЕЗОН", "НОСИТ", "ВХОДИ", "УРОКИ", "УДАЧА", "НОЧАМ", "УЧИТЬ", "НОРМЕ", "ДИЕГО", "ОБРАЗ", "УПАЛА", "ЗВЕРЬ", "ВЕРИЛ", "КЛУБА", "САМИМ", "ТЕАТР", "ВИРУС", "ЭНДРЮ", "СЛЫШЬ", "КАНАЛ", "НЕМЦЫ", "ЖЕРТВ", "ПОЗОР", "ПТИЦЫ", "ГОСТЬ", "СХОДИ", "ДОЧКА", "ШУТКИ", "КРИКИ", "ДАДУТ", "ВРАГА", "ТОЛКУ", "ПОЙДИ", "ЗАПАД", "БОМБЫ", "ВЫПИЛ", "ВЫЙДИ", "ЧЕСТИ", "КОЗЕЛ", "СОСЕД", "УЛИЦА", "ВЫЖИЛ", "ПОКОЙ", "НАХУЙ", "ОТЧЕТ", "СПАСИ", "БАНКЕ", "ФОРМА", "ПАКЕТ", "ШАНСЫ", "ЖДЕШЬ", "СИНИЙ", "ОТРЯД", "МЕШОК", "ДАВАЛ", "ХЕЛЕН", "ВЕДУТ", "ВСТАЛ", "БЕРЕТ", "ДАДИМ", "ПУТЕМ", "ОБМЕН", "ЕВРЕИ", "ЧЁРТУ", "ЛИНДА", "ПРИМИ", "ДОБРА", "РАЗОК", "ЧИТАЮ", "ТАНЦЫ", "ЛЕТИТ", "БОМБУ", "ТАЙНА", "ЛОДКУ", "УБЬЁТ", "ПОВОД", "КАКОВ", "ЗВУКИ", "ВРЕДА", "ОКЕАН", "ЖИВЕЕ", "ГРЕХИ", "ИМЕЛИ", "ХАННА", "ДЕЛАХ", "КРЫШУ", "РОМЕО", "УЙДЕТ", "ПАЦАН", "КРЫШЕ", "ВРАГИ", "НЕСТИ", "МОЛОД", "ВЕРЯТ", "МАЙКИ", "ВОЛНЫ", "КАРЕН", "БРАУН", "МИККИ", "МЕТРО", "ИГРАЙ", "КОНЦУ", "БАДДИ", "ЛОДКА", "МАСЛО", "ТЕМНО", "НЕРВЫ", "СЦЕНА", "МОЛЛИ", "КРЫСА", "СОЙТИ", "САННИ", "СУДНО", "ФАКТЫ", "ШЕСТИ", "РАНЕЕ", "ТОЧКУ", "ЛИНИЮ", "ПОРОЙ", "НОВОМ", "НЭНСИ", "ВАННУ", "ПУШКИ", "ЦЕЛЫХ", "РАЙОН", "РАЙАН", "УЕДЕМ", "ЧЛЕНЫ", "ВРАЧИ", "СУММУ", "МОТОР", "ДЖЕКИ", "ИГРОК", "САЙТЕ", "ЭФИРЕ", "ШЛЯПУ", "ЗАШЕЛ", "УМРЁТ", "ДЕЛАМ", "РЫНОК", "ПУНКТ", "СЦЕНЫ", "БРАТУ", "СПИНЕ", "РАСТИ", "СОШЛИ", "БЕЛЬЕ", "ГРЯЗЬ", "ЛИНИЯ", "ДЖЕСС", "ЖЕНИХ", "ВОШЕЛ", "ФИГНЯ", "КОШКА", "ПОЛОН", "УМНАЯ", "ЧИСЛА", "БЕЛАЯ", "ИЩЕТЕ", "ПЛЯЖЕ", "ЛЮБАЯ", "СТИХИ", "КУХНЮ", "БЕЛЫХ", "ЛГАТЬ", "ТРУСЫ", "ГРЯЗИ", "ГЛЯНЬ", "МАРКО", "КУСКИ", "РОБОТ", "ЖУТКО", "КАПЛИ", "БАНКИ", "ОЧКОВ", "ВЕТРА", "СДАТЬ", "МИЛЫЕ", "УЛИКИ", "НОГАХ", "ВЕЛЕЛ", "ПЛАНА", "ЛЮБЫЕ", "ГЛЯДИ", "НЕБЕС", "НОЖОМ", "ЛОДКЕ", "ОБОИМ", "ИДЕТЕ", "ГОРАХ", "НОГОЙ", "ОЗЕРО", "ВЕДЁТ", "ПЛОТЬ", "ДЖОАН", "ОТЕЛЯ", "БРОШУ", "ЛЬЮИС", "РЫНКЕ", "КРЕСТ", "УДАЧУ", "АЛЛЕН", "ЛУКАС", "ДЮНАН", "КУЗЕН", "ДЖЕКА", "ФОРМЫ", "ОБУВЬ", "СЭММИ", "СИДЯТ", "ТЕЛОМ", "УМНЕЕ", "ОРДЕР", "БЕРУТ", "ГОДОМ", "ЛЕННИ", "ВИЗИТ", "НАУКА", "СРЕДУ", "СЕРИЯ", "ДЫШИТ", "ПЛАНУ", "ЮЖНОЙ", "ДОМИК", "СТИЛЕ", "БОГОВ", "ПАСТЬ", "СОШЁЛ", "НАНЯЛ", "СУДЬИ", "ТАКОВ", "ГЛЯДЯ", "СТОЛА", "ПРИМУ", "ГОВНО", "СИНДИ", "БАБКИ", "ВДОЛЬ", "СЛЕЗЫ", "БОЖИЙ", "ИЩИТЕ", "ЛИДЕР", "ДЖИВС", "АЛИСА", "РОННИ", "СУТКИ", "ПОЕШЬ", "УМЕЮТ", "КЕННИ", "РИПЛИ", "ТАЙНЫ", "АТАКУ", "ПИШУТ", "БЕРЕГ", "УБИТЫ", "САЛАТ", "КЛЕВО", "КИТАЙ", "ЛУИЗА", "УЙДЕМ", "ПЕСОК", "БАРРИ", "ПОИСК", "ВРЕШЬ", "САХАР", "ЗАЙДУ", "ПИЛОТ", "БАШКУ", "ЦЕЛОЕ", "ЮНОША", "ЧИТАЙ", "ЦЕНОЙ", "МУЗЕЙ", "МОНРО", "ЗВЕЗД", "БРЮКИ", "ЛЕЖАЛ", "ШАНСА", "БЛЮДО", "КЕЙСИ", "НОСОМ", "ДЕРЕК", "РОЛЯХ", "БАНДА", "МАСКУ", "ДАНТЕ", "ОХОТА", "ТРОИХ", "КУПЕР", "КРЫША", "ПОВАР", "ХЛЕБА", "ВОШЛИ", "ЕДЕТЕ", "СЬЮЗИ", "ОПЫТА", "ВЛЕВО", "КЭРОЛ", "НАПАЛ", "ДОЛГИ", "ПАБЛО", "НАУКИ", "ГЕРОЯ", "КЛАРА", "ТРУДА", "АВЕНЮ", "МЕСТЬ", "РОДОМ", "ЗАЛОГ", "ДАВИД", "ПОКОЯ", "РУЧКУ", "ЮМОРА", "КНЯЗЬ", "ФОКУС", "АРЕСТ", "УЖИНА", "СТВОЛ", "СПАЛИ", "ТРУПЫ", "ТАЙНУ", "ДОЖДЯ", "ДЖЕФФ", "ШЛЯПА", "ЦЕЛОМ", "СОТЕН", "ДАЕШЬ", "ДОННА", "ВЕГАС", "ПИЦЦУ", "ЧУЖОЙ", "БЕЛОМ", "ПЕДИК", "ЗАМКЕ", "БЕЖИТ", "ДОСЬЕ", "ОТДЫХ", "АКЦИИ", "ЗАШЛИ", "РАНЧО", "ПУШКА", "ВРАЧУ", "НЕЧЕМ", "ЧАШКУ", "ДЕТЯХ", "ШУТОК", "АКТЕР", "БЕННИ", "ЗИМОЙ", "САМИХ", "ВАЖНА", "НЕСЕТ", "СУМКА", "КАРЛА", "ЗВЕРЯ", "БЕЛОЙ", "СНЯЛИ", "МЭТЬЮ", "УГЛОМ", "НЕФТИ", "БАГАЖ", "НАЦИИ", "ВХОДА", "ПЕННИ", "УЧИЛИ", "ВЫПЬЮ", "ОЗЕРА", "УМРЕМ", "УДАРА", "БИТВА", "ТРЕМЯ", "ЕЛЕНА", "КОЗЁЛ", "ЛЕТИМ", "БУКВЫ", "СНИМУ", "ВОШЛА", "КОПОВ", "ЛИЗЗИ", "ПУСТО", "ДУШОЙ", "ОСКАР", "УДАРЬ", "БОКАЛ", "СТЕНА", "ОФИСА", "ШТАТЫ", "ВОЖДЬ", "ЛОДКИ", "ОБМАН", "КРЫШИ", "ЛЕСЛИ", "ПЯТНО", "СЪЕШЬ", "ОБЩИЙ", "ПОЧТУ", "ДЖУДИ", "НОСЯТ", "ЧУЖИЕ", "ОБЩЕЕ", "НАБОР", "ЕЗДИЛ", "ВЕСНА", "ВСЮДУ", "БЫВАЛ", "НАУЧУ", "ВЕЗЕТ", "БОССА", "ОДНИХ", "БЕЖАЛ", "ШКАФУ", "КРЫСЫ", "ЧЕРЕП", "СУМКИ", "ГВИДО", "МИЛЯХ", "ПЛАНЕ", "ПЛЕЧО", "ХАРВИ", "ВЕЛИК", "ИНДИИ", "НУЖДЫ", "СЛАВУ", "СКЛАД", "МАЛЫЙ", "БРУНО", "МУДАК", "КЛАУС", "СЖЕЧЬ", "РОБИН", "ВЕНДИ", "КУПИМ", "КОСТЬ", "ТЕКСТ", "СТРАН", "ДНЯМИ", "ТЕХАС", "ДЕМОН", "ОБЕИХ", "ЧИСЛЕ", "ОХОТУ", "ДОШЛО", "ДУМАЯ", "ХРАНИ", "РИККИ", "ТЕРЯЮ", "МАРКА", "ЗАШЛА", "ШТОРМ", "ТУПАЯ", "СВЕЧИ", "БОРИС", "ЦИФРЫ", "СНЯТО", "СПЕШУ", "РАБОВ", "АЛИБИ", "ЗАЙДИ", "МИНУС", "БЕЛОЕ", "ПЛОТИ", "РУЖЬЕ", "РОББИ", "ЗОВЕТ", "МЕТОД", "НИККИ", "ЗОМБИ", "ДИАНА", "МАРЛИ", "ПИСЕМ", "БРАКА", "ГАРАЖ", "ВАЖЕН", "РУЛЕМ", "ПУЛЬС", "ГРАНТ", "БЕРТИ", "РОСТА", "КРИЧИ", "КУРОК", "ГРАНИ", "ФРОДО", "ХОЛМС", "КРУГУ", "ЕШЬТЕ", "ГЕРОИ", "РЕЖИМ", "ДОМОВ", "ТУМАН", "КОШКИ", "ЭРИКА", "ТРУБЫ", "ТОЛПЫ", "БОГАТ", "ТЯНЕТ", "ТАЧКА", "КОПИЯ", "ЯЩИКЕ", "ГОЛЬФ", "СПИНА", "МЕСТУ", "РУКАМ", "КУХНЯ", "УЩЕРБ", "ДОРОГ", "АЛЬФА", "ЛЬДОМ", "УБИЙЦ", "МАЙКА", "СОФИЯ", "РЕЗКО", "ПЕСЕН", "ПРИЮТ", "БЕРЕМ", "ТВАРИ", "ПОСОЛ", "ДАРОМ", "БИТВЫ", "ПЯТЫЙ", "ЖИВЁМ", "МАРКИ", "СПИТЕ", "НЕФТЬ", "ДЖИНА", "ФИРМЫ", "БАШНИ", "ЗАВОД", "ВОРОТ", "СТРОЙ", "ЛОРЕН", "УМРУТ", "ДУХОМ", "ФЮРЕР", "СУММА", "СТОУН", "ВИДОМ", "ФРАНК", "ДАРСИ", "ПРИДИ", "УБИТА", "КУКЛА", "СОТНЮ", "ДЯДЕЙ", "СЭНДИ", "АЛЛАХ", "ДЕЙЗИ", "ЖДЁШЬ", "ДИКИЙ", "КЛАРК", "СПОРТ", "ТАЧКУ", "РЕШИТ", "КАРТЕ", "ЯЗЫКА", "ВРАТА", "ДОЛГУ", "ВОИНЫ", "СПОРЮ", "ВОЛНА", "БОЖЬЯ", "БЛАГА", "ПОЧТА", "ЗУБОВ", "НЫНЧЕ", "БРАКЕ", "ВЕРИМ", "СЛОВУ", "ДОННИ", "РУЧКА", "МОНТИ", "КРУЧЕ", "ВДОВА", "МЕЧТУ", "КИТАЕ", "СПЕШИ", "СИДИМ", "СНИЗУ", "СЮЖЕТ", "БАНДЫ", "МАССА", "НАШЛО", "СПЕТЬ", "ВЕЗЁТ", "МИЛЛИ", "УРОДЫ", "ДЖИЛЛ", "ЗВУКА", "УТРАМ", "ДРАКА", "БЕЛЫМ", "ХОЛЛИ", "ЧЛЕНА", "ЖИВЫЕ", "ЛЕЖАТ", "ЧУДЕС", "СЛУГА", "ПЕРСИ", "УМНИК", "ХОЛОД", "ТИХИЙ", "СЕМЕЙ", "ЛЕВЫЙ", "МАГИЯ", "СМЕНА", "ПАУЛА", "ШУТКУ", "ТЕДДИ", "ПЬЕШЬ", "ВЕКОВ", "ГРЭЙС", "ЖАННА", "ПОРНО", "РЕШИМ", "ЖДЕТЕ", "СЛАВЫ", "ЗНАКИ", "РЭНДИ", "МЕСТИ", "ШАГОМ", "НАЛЕЙ", "ДИВАН", "СТАТИ", "БЕГУТ", "ХОББИ", "ГРУБО", "СЪЕЛА", "ПОЛЕТ", "ДИКИЕ", "ПРОЩУ", "ПЛАМЯ", "ТОБОЮ", "ШЛЮХИ", "ДЕББИ", "ПОТОК", "СЯДЕМ", "УЙДЁТ", "УЗНАЙ", "УЧУСЬ", "ДЕБИЛ", "КОПИИ", "ПОХОД", "ЕХАЛИ", "ТРАВУ", "ЖАЛЕЮ", "РИВЕР", "ЩЕНОК", "МАРГО", "МОРИС", "ПОДАЙ", "ПАРОЙ", "МАРИИ", "НОСИЛ", "ЧЕТКО", "ДИЛАН", "ПЛЕЧИ", "НАОМИ", "ПУТЁМ", "ЛЛОЙД", "ОЗЕРЕ", "ДОЛОЙ", "ТАЙНЕ", "МОСТА", "ПРОСИ", "УЙДУТ", "БИНГО", "ВАЛЯЙ", "ПОЧТЕ", "ЖИВОЕ", "НАДЕЛ", "ТАЙНО", "ДЕЛСЯ", "РУЖЬЯ", "УМЕТЬ", "МАРИО", "СТАРТ", "БЕРЁТ", "АТАКИ", "ВАЖНЫ", "ОВОЩИ", "ПЛЫТЬ", "МАКСА", "РОККИ", "ТУПИК", "МЕЧОМ", "КОПИЮ", "РАЛЬФ", "ПИЦЦА", "ДОЙТИ", "МАСЛА", "ЛЕЗТЬ", "ВДАЛИ", "ВИСИТ", "СУМКЕ", "ПАОЛО", "КАЗНИ", "ДЕВКА", "КЛОУН", "ПОИЩУ", "РАЙЛИ", "НОГТИ", "КАРЛО", "ВИДАЛ", "ПОШЛЮ", "ДЕТКИ", "ЧУТОК", "АНТОН", "ОТКАЗ", "ТАЙМС", "СЕКСЕ", "МОСТУ", "ФИШЕР", "ПЕДРО", "БЕРНИ", "СВЕТУ", "БАШНЮ", "ИДЕЕЙ", "ОРАТЬ", "ТУПЫЕ", "ВСЛУХ", "ОГНЕМ", "ЖИВЕЙ", "МЕГАН", "ЛАУРА", "СЕРИИ", "ЛАМПУ", "ТРАТА", "КИТАЯ", "НОСКИ", "НЕЖНО", "ЕБАТЬ", "МАРДЖ", "ПОЛНА", "ШПИОН", "ХУЛИО", "ФИНАЛ", "ТРУБУ", "ЛИФТЕ", "ЛАПША", "ВОШЁЛ", "ЗАПАС", "ГЛАВЕ", "ТРАВА", "ОКРУГ", "НИЗКО", "КОННИ", "РУЧКИ", "ЖИВАЯ", "ОБУВИ", "СИДНИ", "ФЕРМЕ", "ИДЁТЕ", "ИГРОЙ", "СЛЁЗЫ", "РЫЧИТ", "ПАРКА", "ПИДОР", "СРЕДА", "ПЕНИЕ", "ВДВОЕ", "БОННИ", "ЭЛВИС", "ШТАТЕ", "ГРУПП", "НЕКИЙ", "ОТДАЮ", "ДОМАМ", "ЖИЛЬЕ", "БЕЙЛИ", "ШАГОВ", "МЕРФИ", "МОТИВ", "ПЕРРИ", "ЗАШЁЛ", "ВИДОВ", "УМНЫЕ", "КАМНЯ", "ЭКРАН", "СНЕГА", "ЛЮБЫМ", "ДУХОВ", "УПАЛИ", "МУЗЕЕ", "БЛАГО", "СТРОЯ", "ОЛЬГА", "СРЕДЫ", "ВКУСЕ", "ГАЗЕТ", "ПУЛЬТ", "УЧИСЬ", "МЕШАЙ", "ВОЙСК", "ХВАЛА", "СЫРОМ", "ТЕЧЕТ", "КЕЙЛИ", "ДОШЛИ", "БЕККИ", "СКАЛЫ", "ЛОРДА", "ЦЕЛЫЕ", "ГОЛОД", "ГОНКИ", "ФАННИ", "МОРДУ", "КОШЕК", "ФРОНТ", "МАСКИ", "ПАРИК", "МИЛОЙ", "ПОБЕГ", "ЗАКАТ", "ЛЕВУЮ", "УЗНАВ", "ЗЛЮСЬ", "МЫШЦЫ", "ФРЕНК", "ТРАВЫ", "ДЭВИС", "МАРОК", "ЦЕЛЯХ", "СЧЕТУ", "МАСКА", "ХОДИМ", "ДРУГЕ", "ВОЛКИ", "ЛАПШУ", "ВЗДОР", "СТАДО", "ШЕЛЛИ", "СМЕНУ", "СМЕНЫ", "МЯГКО", "КЛЁВО", "ПЕНИС", "ДЖОДИ", "ЗАДАЛ", "СЛУГИ", "БАРОН", "ВАГОН", "СНЯЛА", "СРОКА", "КРЕЙГ", "ЧУДНО", "СУМЕЛ", "АКЦИЙ", "ЦЕЛЕЙ", "СПАСУ", "ВРЁШЬ", "ШЕРРИ", "КОЛИН", "РЫБКА", "ТАНГО", "ВОДКИ", "КУРСА", "МОНАХ", "БЕСИТ", "АТАКА", "ТОЧКЕ", "ДЕНЕК", "БРАЛИ", "РАБОТ", "МАГИИ", "СДАЧИ", "КАЗНЬ", "БАНКУ", "САЛОН", "ФЛОТА", "ЭТАЖА", "ЛЖЕШЬ", "СТОИМ", "СЧЕТЕ", "УХОДА", "ПОДАЛ", "АКУЛА", "ЛЕВАЯ", "ФИОНА", "РОККО", "ЗАМКА", "КУЧКА", "УДАРЫ", "ЗАНЯЛ", "ПАРНЕ", "ЧЕЛСИ", "ПАДРЕ", "РЕДЖИ", "НЕГДЕ", "ОБЩАЯ", "ЯКОБЫ", "ДИКИХ", "СЪЕЛИ", "ДАЁШЬ", "НАЧНИ", "КУРСЫ", "АКУЛЫ", "РОКСИ", "ВЫВОД", "ЗАБОТ", "МИЛЫМ", "НОЖКИ", "КОРОВ", "ТЕСТЫ", "ФИРМА", "ШАЛОМ", "СЛЕЖУ", "ЛЕТЯТ", "ЧИПСЫ", "БЛАНШ", "ГОЛЫЙ", "ФАНАТ", "ЧУЖИХ", "ОДЕТЬ", "ЕДИТЕ", "КЭРРИ", "СОЙДУ", "УЮТНО", "ПСИХИ", "ПЛАТУ", "ДУРОЙ", "БИЛЛА", "ЛОВКО", "ХУЙНЯ", "КУПИТ", "ШКУРУ", "АНДРЕ", "МИЛОЕ", "ЗВЁЗД", "КУБОК", "ОТЦОВ", "ЗАДАМ", "ЛИДИЯ", "ТАКЕР", "БАШНЯ", "ВЕРНА", "ФОНДА", "СИМОН", "ДРАКУ", "ОБЩЕЙ", "КУКЛУ", "КУХНИ", "ВОДКУ", "ФЛИНН", "ЛЮБЫХ", "ЖЕЛАЛ", "СУДОМ", "БАШНЕ", "КОНЦЫ", "ПЛОХИ", "ГРЕХА", "ДИКОЙ", "КУРИЛ", "КИШКИ", "ПЬЕСУ", "ИЗБИЛ", "КАМЕР", "МОЗГУ", "ПОЛНЫ", "ПТИЦУ", "СИЛЕН", "УМРЁМ", "БАШКА", "БИТВЕ", "НАЖМИ", "УЙДЁМ", "МОНЕТ", "ЮРИСТ", "ПОКЕР", "ОТБОЙ", "ЗАДОМ", "ШАРИК", "РЫБОЙ", "ДЕННИ", "ЭМБЕР", "ФЕРМА", "ГОЛОЙ", "ШУТИТ", "МЕШКИ", "ВСЛЕД", "ПАЧКУ", "ВЗВОД", "ПЕЙТЕ", "ПАЛКУ", "ГРОША", "СУТОК", "МЕТРА", "СУДНА", "ТКАНИ", "ЭСТЕР", "СУХОЙ", "РАМОН", "ЗВЕРИ", "ШЛЯПЫ", "ШТРАФ", "КРЫЛО", "ЧУДОМ", "ТИТУЛ", "ПЕТРА", "КЛАНА", "ЧИТТИ", "ИРАКЕ", "ГЛУПИ", "АДАМС", "ХАЛАТ", "ЛОГАН", "ШИШКА", "УБЬЕМ", "СБИТЬ", "УЧЕБУ", "СИНИЕ", "ВОИНА", "ФАЙЛЫ", "ГЛАЗУ", "СЛЕДА", "ЭЛИЗА", "УЕДЕТ", "СПИНЫ", "РАЦИИ", "ХРАМА", "СТАНЬ", "ОБАМА", "ДОЛГА", "ОДЕТА", "КОРНИ", "МЭННИ", "УБЕРУ", "ЕЗДИТ", "КЛАДИ", "ЧЕРТИ", "ЖРАТЬ", "БЕЛУЮ", "ВОЛЬТ", "ФРИДА", "ЭЛЛИС", "ЗОВЁТ", "СЛОНА", "МАРКС", "СМЕЛО", "ФЕРМУ", "КЛАЙД", "ВКУСА", "ЭПОХИ", "ВЫКУП", "ПОДАМ", "ДИКАЯ", "КЭССИ", "ФИЛИП", "ЧАСАМ", "ЖАЖДУ", "ТРУПА", "УБРАЛ", "ДОХОД", "ПИНКИ", "ВКЛАД", "ЯРДОВ", "ЗАЕДУ", "МАЙЛС", "ГОВНА", "ДЖОЭЛ", "БЛЮДА", "СМЕХА", "РАВНЫ", "КОШКУ", "РАЗОМ", "НОЧЕЙ", "АЛМАЗ", "ХРАМЕ", "КАТЕР", "АБОРТ", "РИСКА", "ЦЕНТА", "ПЕРЕЦ", "СОТНЯ", "ОТЧЁТ", "ПЬЕСЫ", "ФРАЗА", "РАМКИ", "ПОППИ", "ШЛЯПЕ", "ПЬЕСА", "ТЕЧЁТ", "УСПЕЮ", "РЕМНИ", "ПРОФИ", "ПОИЩИ", "ХАСАН", "МРАЗЬ", "ДЖОНИ", "ОБЫСК", "НЕСУТ", "ШТОРЫ", "СОННИ", "НАУКЕ", "ИМЕЛО", "КУРИТ", "КРУГА", "СОЮЗА", "ПЯТНА", "ХОЛЛЕ", "ПЬЯНА", "ОБХОД", "ГОНКА", "АВИВА", "ГАНДИ", "ПОЛЛИ", "СМЕСЬ", "ТОЛПУ", "ВЕТРУ", "ЗАРЯД", "ДЖИМА", "ДЕЛАЯ", "ГНЕВА", "ПРАВУ", "МОРОЗ", "ГОРЯТ", "ГОСТЯ", "ШЕРИЛ", "БЛЕСК", "АДАМА", "СДАЧУ", "ЖАЖДА", "ПЛАТА", "АКТЁР", "СЛЕЗЬ", "ДОСКЕ", "БОЛЯТ", "ЭЛИОТ", "ВЕДРО", "ВОЛНУ", "УЛАЖУ", "ОТСЕК", "ЛАЙЛА", "МАФИИ", "КАНУН", "МУЖЬЯ", "ВЕСТЬ", "УМНЫМ", "ЭЛЛЕН", "ХЕЙЛИ", "ААРОН", "ТОЛПЕ", "ВОЛКА", "БУКЕТ", "ВОРОВ", "ДРАКИ", "УБИЛО", "ПАЛКИ", "ЗАБЕЙ", "НАХЕР", "ДЫРКУ", "НЕМЕЦ", "РЫНКА", "МАЙЛО", "ОХОТЫ", "ТОПОР", "БЕЛЬЯ", "САРАЙ", "ПИВКА", "ХОЛМЕ", "ЗАМРИ", "РУПИЙ", "ОДЕТЫ", "ХЕРНЮ", "ВУЛЬФ", "ПЬЁШЬ", "УСНУЛ", "МАССУ", "СТОЛУ", "МИГОМ", "ГРОБУ", "ЗАПЕР", "ДАФНА", "СТЫДА", "ЭМИЛЬ", "МУЗЕЯ", "ЗАБОР", "НАРЯД", "ТКАНЬ", "КОЗЛЫ", "ДИСКИ", "ПАВЕЛ", "БРАЙС", "СИНЯЯ", "ФРАЗУ", "ВЕЩАМ", "ДОМАХ", "ДОСКУ", "ЗАМКИ", "ЛЕЗЕТ", "УПАЛО", "РЫБКУ", "ТАНКИ", "ВЕЗТИ", "ЛАМПА", "ЯЩИКА", "ХОЛМА", "ОКАЖИ", "ЛЕВЕЕ", "ТРУБА", "ЛЭРРИ", "ЧАСАХ", "ИСХОД", "ВЕСИТ", "ЛЫСЫЙ", "ОПЕРУ", "ЮЖНЫЙ", "ПЕВЕЦ", "ПОСПИ", "ДЕВКИ", "АРЕНЕ", "СЯДЕТ", "ШЛЮХУ", "ГОМИК", "ПЛАТИ", "СЕРИЮ", "ЦЕЛЫМ", "КУЧЕЙ", "СЕЙФЕ", "НОГАМ", "БЕГАЛ", "РЫЖИЙ", "ВЕШАЙ", "ПОКАЗ", "ЭЛЕЙН", "МИШКА", "ШИРЛИ", "СИЛАМ", "НАТАН", "ЭНДЖИ", "ШЭРОН", "ВОЙДУ", "ПЕПЕЛ", "БЕЙТЕ", "ПИВОМ", "БРАЛА", "ОКНОМ", "БРУКС", "БОЛЕЛ", "ДЖЕНИ", "ГОНКУ", "ИОСИФ", "РАУНД", "РЕШАЮ", "КАРЛИ", "СЛОВЕ", "НЕСЁТ", "ЗАЛЕЗ", "МЫШЕЙ", "ИНОГО", "БУМАГ", "УЖАСА", "ОРФЕЙ", "РУЛЁМ", "ПЕГГИ", "ЛОННИ", "УЧИЛА", "ЕХАЛА", "ВЫДАЛ", "ГОДАМ", "ОТВЕЗ", "ЯСНОЕ", "БЕГАХ", "ВЫПАЛ", "ПЕСНЕ", "СЕАНС", "МАРСА", "БИТВУ", "КАНАТ", "БОЙЦЫ", "СЕНАТ", "КЭТТИ", "ЮДЖИН", "УВЕДИ", "ЗЛИСЬ", "ЭДГАР", "КОВЕР", "ПЯТОЙ", "ТРАТЬ", "ПОСТУ", "СЕРЫЙ", "МИРНО", "ДОСКИ", "РОЯЛЬ", "ДЖОЙС", "СМИТА", "ПЛОДЫ", "ТРЮКИ", "ТЕСТА", "СТАВЬ", "БЕЛЬЁ", "МЭТТИ", "ЦЕЛОЙ", "ДЫРКА", "СВЫШЕ", "КИТТИ", "МЭНДИ", "МАЙЛЗ", "СИМБА", "ХЕЗЕР", "ГРАФА", "СЛАБО", "КИСКА", "ПЛЕНУ", "САЛЮТ", "КОНЕЙ", "КРУГИ", "ОДЕНЬ", "СУММЫ", "УОЛЛИ", "БАШКЕ", "РАЦИЯ", "ВИННИ", "ГЕЙТС", "РИГГС", "МИТИО", "ЗАПАЛ", "РЕШАЙ", "БЕЛЛА", "СРЕДЕ", "ЕВРЕЯ", "ЗАТЕЯ", "ТЕСНО", "ОГАЙО", "БЕДРА", "ЛЮТЕР", "БРЭДИ", "МАТЕО", "ПЛЕМЯ", "ВАННЫ", "ЧЕРТЫ", "ФРЕДА", "БАЛЕТ", "ДВОРА", "ОСЛЕП", "ХИМИИ", "ЮЖНАЯ", "СТУЛЕ", "ГЛАВЫ", "ГРИБЫ", "РАББИ", "БУКВУ", "ТИПОМ", "ГОНКЕ", "МАРСЕ", "ПИЦЦЫ", "ЛОЖЬЮ", "СКОТЧ", "КРАЖА", "ЗАШЛО", "ИНДИЯ", "КОЗЛА", "ОСЕНЬ", "ХАЙЛЬ", "КОПОМ", "ВОДКА", "МОРГЕ", "БЕРЁМ", "КОВЁР", "ОМЛЕТ", "РИШАР", "ЙОХАН", "КОСЯК", "ДАРБИ", "ДРОВА", "РУЖЬЁ", "ВХОЖУ", "КАПЛЯ", "АГНЕС", "ПОРОГ", "ВКУСУ", "ЭТАПЕ", "ГРОЗА", "КУКЛЫ", "ФИРМЕ", "ВЕДЕМ", "КАДРЫ", "РЫЧАГ", "ОГНЁМ", "МАССЫ", "СКУКА", "ТАБАК", "АНИТА", "ПАДАЮ", "ФЛОЙД", "КУЛАК", "ЛОВИТ", "ПЫТКИ", "БЫВАЮ", "РОСЛИ", "РАНИЛ", "МОРЕМ", "РУБЕН", "ДИККИ", "СКОТИ", "ЛАМПЫ", "НАЦИЯ", "ЖДЁТЕ", "СЪЕСТ", "БЬЮСЬ", "ГУЛЯЛ", "ОЛЕНЬ", "ГОЛЫМ", "СТАЛЬ", "ВОРОН", "ЗАБИЛ", "ДУРНО", "БАНДУ", "РАБОМ", "СБОРА", "СБИЛА", "МАРСИ", "ГЕТТО", "ШАТТЛ", "ХОРХЕ", "ШАХТЫ", "ШАНТИ", "ЩЕДРО", "АВАНС", "ДОСКА", "СТИВА", "ДЕНЁК", "ИГРАЯ", "ЧАШКИ", "ЗАДАЮ", "ОБЕДУ", "МЯЧИК", "ЧЕРВИ", "ШАХТУ", "ТРЕТЬ", "ОЧКАХ", "ПОПКА", "ДИКСИ", "ГУДОК", "ВЫВЕЛ", "РОЛЛИ", "МАГИЮ", "ТЕПЛА", "ЭММЕТ", "ТИХАЯ", "МАФИЯ", "УЖАСЕ", "ЯРКИЙ", "ТИММИ", "БРЕМЯ", "НОРМЫ", "МЕШАЮ", "САРАЕ", "ЯЩИКИ", "СВИСТ", "ЛЕММИ", "ХАОСА", "КЭНДИ", "ДАВИТ", "КВИТЫ", "ФРАНЦ", "НАЛЬЮ", "ВНУКА", "ЕЗДЯТ", "ПИРАТ", "РЕШАТ", "ЮЖНОМ", "КРАЯХ", "ЛОВЛЮ", "ТОННЫ", "ОБЩИЕ", "ВЕРЕН", "ЦЫГАН", "ЛЫЖАХ", "ТАНЦА", "БИШОП", "КЛЮЧА", "МЯЧОМ", "ВАНДА", "ПОЛЁТ", "ЗАПРИ", "ВИНОМ", "ВЫТРИ", "ВЕЛИТ", "ВОДИЛ", "ЛГАЛА", "ИГОРЬ", "НАДИН", "САЛАМ", "ГЕККО", "АФИНА", "ДУЭЛЬ", "ГРАММ", "ЛЕТАЛ", "СТАРА", "КОРЕЕ", "СУДЕЙ", "НАЛОГ", "ЛАВКЕ", "БОССУ", "БЕЙТС", "ПОСЛА", "ПОРТУ", "ВАННА", "ШАГАЙ", "ЯЗЫКИ", "ПЯТОМ", "ДУБЛЬ", "ФИГНЮ", "СРАНЬ", "УОКЕР", "КЛУБЫ", "ТОСКА", "ВЕСНЫ", "ТРУБЕ", "ВЕРНЫ", "СЛУЖУ", "УЖИНУ", "ТАЧКИ", "НЕБОМ", "ГОЛАЯ", "БОГАМ", "НАФИГ", "КАКАО", "КИТОВ", "ДРАЙВ", "ДЖУНО", "ДЕВИЗ", "ВЕРОЙ", "УГОЛЬ", "ПАРАД", "ШРАМЫ", "СИЛЁН", "БЛЕЙК", "ФИРМУ", "КОЖЕЙ", "КИШКА", "ДЖОНУ", "ПОБИЛ", "УБЬЁМ", "ДВОИМ", "НАЦИЙ", "ПЁСИК", "ФОТКИ", "ИГРАХ", "АРАБЫ", "ХИППИ", "БАРНС", "СУДЬЕ", "СТРОЮ", "ПЕТУХ", "ССОРЫ", "ЛИМОН", "ШОФЕР", "СЧЁТА", "БРАТЕ", "МОРДА", "ГРИПП", "ЛАЗЕР", "ДИЕТЕ", "НОЛАН", "ШТАБА", "СУДНЕ", "ДАЕТЕ", "ОПЕРЕ", "ПЕСКЕ", "ТЕРЯЙ", "ГНАТЬ", "ДАРИТ", "ПРОСТ", "НИКЕМ", "ГОРЛЕ", "РЕЛИЗ", "ШАРОН", "ОБРЯД", "КОГТИ", "БУКВА", "ЧЕРЕД", "ДОЧКУ", "СОНИК", "БЕЛКА", "АТАКЕ", "ПЕРЬЯ", "СКОТА", "ПЕСКА", "РЫБКИ", "ЛОВЯТ", "МАЙКУ", "ПОЛКЕ", "БОЛЬЮ", "ПЕТЕР", "РОДНИ", "ТАББС", "ОПЕРЫ", "УГОЩУ", "ОБЛИК", "ГОДАХ", "НАУЧИ", "РЕШКА", "СУДЬЮ", "ИМАРИ", "ГОДОВ", "ОПЕРА", "ДОЧКИ", "ПОЛЯХ", "ПЬЯНЫ", "ВИДНЫ", "РЕЙХА", "ОБЩИХ", "ГЛУШИ", "УПАДУ", "ДОШЛА", "СЛАВЕ", "УПАСИ", "УШАМИ", "СБИЛИ", "ХУДОЙ", "БАРБИ", "ОЛЕНЯ", "БУДДА", "АВИВЕ", "МЕГГИ", "ДЕВОК", "ОЛУЭН", "ФРОСТ", "КЛАЙВ", "СОСКИ", "СМЕШИ", "БЕКОН", "ДОШЕЛ", "ТУПЫМ", "ДОТЛА", "НЕКТО", "ДОРИС", "ДЫРКИ", "ДЖОУИ", "ШЛОМИ", "ПОЧКИ", "ПОЛКА", "МИРОВ", "ЛЖЁШЬ", "СПОРЫ", "ЧУЛКИ", "ПЬЕСЕ", "ТРАВЕ", "ЛАВКУ", "УИЛЛА", "БРАЙН", "КУСТЫ", "СКВЕР", "МОЛОТ", "ССОРА", "СВЕРХ", "ВЫЛЕЗ", "СРОКИ", "АЛЬМА", "СМЫТЬ", "КЛАДУ", "ЛИФТА", "СУЧКИ", "ДЕВКУ", "УРОДА", "СКАУТ", "ДЕНИС", "СФЕРЕ", "ПАНДА", "ДЖОУЛ", "ТАМАР", "ФРАЗЫ", "ЛИЛИЯ", "ФЕРМЫ", "ЙОЗЕФ", "ЧЕЙНИ", "КУРЯТ", "ОРГАН", "ПУСТА", "ШВАРЦ", "НЕКАЯ", "ЗВАЛА", "ВОЙДИ", "ПЕСНЬ", "ВСТАЮ", "РЕЧЬЮ", "КОПАМ", "СТИЛЯ", "ВОДИТ", "РАДАР", "ШМИДТ", "КИНУЛ", "ПЛЕЧУ", "ОГЛОХ", "САРОЙ", "ФРЕДО", "НОРМУ", "ХОРОМ", "ГРЕТА", "СМЕЕТ", "ВАЛЬС", "ПЬЕТЕ", "ЧУЖУЮ", "МОРЯК", "ВАННЕ", "ПРОБЫ", "ЙОСЕФ", "ШАХТЕ", "ГЛАВУ", "МАСКЕ", "МАРИЮ", "КУРСУ", "ЧИННА", "МАТЧА", "ТРАНС", "ПЛЫВИ", "НАУКУ", "МАРКУ", "ПУСТЫ", "ПОРОХ", "НЕМОЙ", "ТИПОВ", "ПОЧТЫ", "ГУБКИ", "ПЧЕЛА", "ТУРНЕ", "БАРАН", "ПАРОМ", "ПЯТАЯ", "ГОРЛА", "ТОРТА", "МУДРО", "РАКЕТ", "ГОМЕР", "БЕРНС", "ДЖЕЙД", "МАРНИ", "ХУЛИЯ", "ВЫНЕС", "ТЕРЯЛ", "БИРЖЕ", "ПОЛКУ", "ВЕРХУ", "КАССУ", "СОБОР", "ГОРДО", "КАРИН", "АРЧЕР", "ФРАНС", "ПОЧЕМ", "УИЛЛИ", "ВУАЛЯ", "ДЮЙМА", "ШАПКУ", "ВЗДОХ", "КРИЧУ", "СДАЛА", "КАРИМ", "ТОСТЫ", "БОЖЬЕ", "ШЕЙЛА", "ТИХОМ", "ЛЕГЛА", "ГНИТЬ", "ОТНЯЛ", "РОДНЯ", "РЕКОЙ", "КЛИШЕ", "КИОТО", "КУСКА", "ИНДИЮ", "ПОЛЕЗ", "УРОКА", "ЛЕЙЛА", "ТЕЛЕК", "КРИСИ", "ТЕЦУО", "КЛАУД", "СОРТА", "СТОНЫ", "РОДОВ", "УСЛУГ", "КНЯЗЯ", "АРХИВ", "ЕЖЕЛИ", "КОПИЙ", "СУЩИЙ", "МОДНО", "МУЖЕЙ", "ЗАВЕЛ", "БЭМБИ", "СТИВИ", "ЧАСОМ", "СУХИЕ", "ШРИФТ", "ТОНКА", "ГОРОЙ", "МАКСИ", "ЧЕРВЬ", "ВАЛИМ", "АГАТА", "МОЗЕС", "ТРИША", "КАРРИ", "ЧОНСИ", "УТЕБЯ", "СДАЧА", "ДУЭЛИ", "ЭВАНС", "ОРЕХИ", "ОТАКУ", "ПУТЕЙ", "ТРАЧУ", "АКРОВ", "ЮЖНУЮ", "БЛАНК", "МЯСОМ", "ПЛЕЧЕ", "КУШАЙ", "ЦЕНИТ", "КРИКС", "ХЬЮГО", "ТОНЕТ", "РОЛИК", "СУЧКУ", "КРОСС", "НИГЕР", "ПОСТА", "ОСТИН", "ШЛОМО", "ЭПОХУ", "ВАФЛИ", "ТРОНУ", "АДЕЛЬ", "БАРНИ", "МОРДЕ", "СПОРЬ", "КУКОЛ", "ВРЕЖЬ", "ПОЛОМ", "СТОЛБ", "СКАЛА", "ХРАНЮ", "ПАДАЛ", "СИНЕЙ", "ШАРЛЬ", "ПЕЙДЖ", "ЧАШКА", "ПЛАТЫ", "ИВАНА", "ГОЛЫЕ", "ПОЛЯК", "ОБЛОМ", "ДЛИНУ", "СИССИ", "ДОТТИ", "ХАРРИ", "ДЭЙЛИ", "СКУКИ", "АНДРЭ", "ДАМОЙ", "ЖУЛИК", "ХАРДИ", "ПЧЕЛЫ", "ЗНАМЯ", "ДОЖДИ", "СИНЕЕ", "РЫЖАЯ", "МАРТЕ", "ВОЖДЯ", "ЛОЖКИ", "ПЯТЬЮ", "ГНЕВЕ", "МЕШКЕ", "ЧЁТКО", "ВНУКИ", "ЧУЖИМ", "ЩЕНКА", "ИГАЛЬ", "КЕЙТИ", "ГРИНЧ", "ПОЧВУ", "ЧИСТА", "ЯРКИЕ", "РИСКУ", "ПОДЛО", "СТОИЛ", "КОРЕИ", "ОПЫТУ", "НИЧЬЯ", "ПОЯСА", "ОТПОР", "ТИГРА", "СРЕДЬ", "ЧИСТЫ", "КРУТИ", "ВЕСОМ", "ЖИЛЕТ", "ПОРВУ", "ШТУКЕ", "ПАЛКА", "СХЕМА", "ЗАДЕЛ", "ПРАЙС", "КОЛЕЦ", "РУФУС", "ДЖЕКС", "ГЮСТО", "СПУЩУ", "ГУЛЯЮ", "НАЖАЛ", "ВЫРВУ", "ПОЛЕЙ", "ЖЕЛАЯ", "ХИДЕО", "БАЗАР", "ПАДАЙ", "ГОЛОВ", "ПЫТКА", "ГАЗОМ", "БРОВИ", "ГЛУПЫ", "СЭМОМ", "МИНЕТ", "ВЕЗУТ", "НАНЕС", "ЭЛИТА", "ГЛЕНН", "ЗАЛИВ", "УДАРЮ", "ТРУДИ", "ШТАБЕ", "ФУНТА", "ТЕНЕЙ", "ИОАНН", "СИЗАР", "ХОДОМ", "ОХОТЕ", "ШКАФА", "СЛАБА", "ДРАМА", "ШУМНО", "БАБОК", "ЛЕВОЕ", "ПОЙТЕ", "ЛОЖКУ", "СТЕЙК", "СОБОЮ", "РЫБАК", "ВИНОЙ", "ДРОЖЬ", "РОДЕО", "ШАХТА", "ОБЗОР", "РАУЛЬ", "ДЖИНО", "КОНЧУ", "УЛИКА", "ЛАЗЛО", "ПАПКУ", "КЕЛЬД", "САМЕЦ", "САЙТА", "КАЙЛА", "БАТЬЯ", "КЛЮЗО", "СИЯЕТ", "МОЛЧА", "ДОЛЛИ", "ЛУНОЙ", "РЕЙСА", "ПРАВЕ", "ЦЕНЯТ", "РАЦИЮ", "ИТОГО", "ПОВЕЛ", "ГЕНИЯ", "РОСЛА", "ТАЛОН", "УЗЛОВ", "БАБКА", "ГУБАМ", "АЙРИС", "ИРАКА", "КУПОЛ", "ЦЕЛУЙ", "УРОКЕ", "ИНЫМИ", "ВЗНОС", "ЖЕТОН", "ШУТИЛ", "ПЫТОК", "КРАЖУ", "ЛАПШИ", "ПОЧВЕ", "ФРЕНЧ", "КОТОВ", "АЛЬФИ", "ШОРТЫ", "КРИСА", "ЛЕКСИ", "СВЕЧУ", "ВРАГУ", "УДАРЕ", "РЯДАХ", "БРИДЖ", "КИПИТ", "ЛЕЗУТ", "СБОРЕ", "ХОЛМЫ", "ЖУКОВ", "ИМИДЖ", "ЛЕНТУ", "ДУАЙТ", "ШЛАНГ", "АМИГО", "АЛАНА", "ДЖЕКУ", "ТОКОМ", "ДЭЙЗИ", "ПАУЛО", "РЕЗНЯ", "ЯЙЦАМ", "ДАДЛИ", "ЭЛИТЫ", "ДУЭЙН", "УИЗЛИ", "МЕНЯЮ", "ЛИСТА", "ВЕЗЛО", "ДРАКЕ", "ВЫЛЕТ", "ЦИРКЕ", "ПОЛКИ", "ЛЕТЕЛ", "СТУЛА", "ТОНОМ", "КАССЫ", "КОТИК", "ПОХУЙ", "ТУТСИ", "ЗЕЛИГ", "ПОФИГ", "МАЛИК", "ДРЕДД", "ЕЯНБЙ", "СПУСК", "СКАЛЕ", "ЛЕСАХ", "ЗЕРНО", "ЮНОШИ", "САПОГ", "БЫКОВ", "КАМНЕ", "ЛЖЕТЕ", "ГРАНЬ", "УЧЕБЫ", "ОРДЕН", "ВОЛНЕ", "МАСЛЕ", "НОРМА", "СОЖГИ", "ВИДНА", "ЭФИРА", "ВИНЧИ", "МОЗГЕ", "САНТИ", "КЭЙСИ", "ТЭДДИ", "ШПРИЦ", "ЖАЛОБ", "КРЫСУ", "ИЛЬЗА", "ВОРОМ", "ГУБАХ", "ФЛОТЕ", "ЗУБАМ", "СДАЛИ", "КАЮТЕ", "ДЕВИД", "ГЛУПА", "БЕНУА", "ШЕФОМ", "ДОБРУ", "ОПЫТЕ", "ГРЕКИ", "БОЙНЯ", "ТЕЛКИ", "ОТБОР", "КАДРЕ", "ПУАРО", "ТЭММИ", "УЭСЛИ", "ХЕНРИ", "ВЕДРА", "СЛЕДУ", "ВЕЩЬЮ", "ДЛИНА", "ЛЕЧИТ", "ШИШКИ", "ПЛАЗА", "ВВЕЛИ", "ЯКОРЬ", "КАМИН", "РУКАВ", "РЕБРА", "ЛУКОМ", "ВЫДОХ", "БЕДРО", "ОРСОН", "ФЛОРА", "СЮЗАН", "УГНАЛ", "ДОББИ", "БАНАН", "НАЦИЮ", "ЦИФРА", "ИСААК", "СЛОАН", "ЯБЛОК", "ДЖИНН", "ТАЧКЕ", "РАКОМ", "БРЕТТ", "БЕЛОВ", "УМЕЕМ", "ВЕНЕЦ", "ПОЭТА", "ЛЕСОВ", "БЕДЕН", "ЛУИСА", "НЕГРЫ", "ГРОБА", "ЖАЖДЫ", "БАННИ", "ЯСНЕЕ", "СНЕГУ", "ПЯТКИ", "ДРАМЫ", "ДАРИЛ", "ТИХИМ", "ЖИЛЬЁ", "ДИЕТУ", "ПЕРЕС", "БЫСТР", "МАМИН", "БОРДО", "ЗУБАХ", "ДЕНИЗ", "ЛЕГБА", "КАЛЕБ", "САЛИМ", "БЭЛЛА", "КИДАЙ", "ОБНЯЛ", "НЕЛЛИ", "РУЧЕЙ", "ПАПИН", "ТРОНЬ", "ОБЩУЮ", "МАЛОЙ", "ТЕТЕЙ", "ПЛОХА", "ФАКТА", "МАНГО", "КОРЕЮ", "ОБИДУ", "ПОМЕР", "ТЕЛКА", "ВЗЛОМ", "ВИККИ", "ЗЛОГО", "ЛЬВОВ", "ОСТРО", "БОБОМ", "ХУЙНЮ", "РЕГАН", "СЕКСИ", "ПСИХА", "ФЛИНТ", "ОГНЕЙ", "МОСТЫ", "АХМЕД", "ПУЛЕЙ", "СЛЮНИ", "ЦЕНИМ", "ИВОНН", "ТЕНЬЮ", "ЛАСЛО", "МЕРСИ", "ВЕДЬМ", "НАМЕК", "ЗАДАЙ", "ПОСТЫ", "АМЕЛИ", "СОЖГУ", "ГОЛДА", "ДАФФИ", "ЧЕРВЯ", "БЛЭЙД", "КАРНИ", "НАДАВ", "ФИШКЕ", "СИНЯК", "СПАЙК", "ГРАНД", "МЕССУ", "БРЫСЬ", "ГЛЯЖУ", "ДАЁТЕ", "ПОЁШЬ", "ТОСКИ", "ВИСТА", "СОУСА", "ТОЧЕК", "СХЕМУ", "ТУРОК", "РАДЖУ", "ПОЧВА", "НОЧКА", "ПОБЕД", "СЭЛЛИ", "ТЕРПИ", "РИСУЮ", "СПРОС", "СИСЕК", "БЭТТИ", "АВРАМ", "ХЕРНИ", "РУВЕН", "МАЙЛИ", "ОБАМЫ", "ЗАЙКА", "СУЕТА", "БОГАЧ", "ФИЛМЗ", "МАЛЫМ", "ЗАБЕГ", "БАКЛИ", "СТОЛЫ", "ПРЕСС", "ЛГАЛИ", "БОЧКУ", "СМЕНИ", "УЛОЖУ", "БАУЭР", "СУМЕЮ", "ЗАЙМУ", "СФЕРА", "КОПЬЕ", "САДОМ", "ВИДОК", "ДЕВИЦ", "НИТКИ", "ЛИНИЙ", "ЖУЧОК", "ГРУЗА", "КРУИЗ", "СПЕНС", "ГРЕХЕ", "ИСЛАМ", "РВАТЬ", "ЙОРИК", "ДЕВОН", "АКУНА", "ТЕЙЕР", "ДЖУЛС", "ХЭППИ", "СЧЁТЕ", "ОБЕДЫ", "МЯГЧЕ", "ЗАЙМИ", "ПАЛАЧ", "СВЕЛА", "ЧУДАК", "ВХОДЕ", "ЖЕРАР", "ЗЕЛЬЕ", "БЫТИЯ", "КОРЕЯ", "СЕЙФА", "ВЫДАМ", "СОКОЛ", "СКОЛЬ", "ЕДИНЫ", "КРАЖЕ", "ИДЕАЛ", "ЛЮЧИЯ", "СЛОЖА", "ЖАЛОК", "ЯСНЫЙ", "МАТЧЕ", "ШАГАХ", "МАЧЕК", "ЛОМАЙ", "ПАСТА", "ПАУЗУ", "ПЛЯЖА", "ЖОПОЙ", "ГУТТЭ", "ТЕЛИК", "ЛЮПЕН", "ГОЛДИ", "ФИШКА", "УИТНИ", "СЕЛМА", "ЛИШИЛ", "ЖИЛЬЯ", "ЦИРКА", "УВЕЛИ", "ТАНЦЕ", "МЕЧТЕ", "РУИНЫ", "МЭРОМ", "НАСОС", "ЛЕНТЫ", "ПУШЕК", "ВЕТКИ", "ВЕДЁМ", "ЯГОДЫ", "АТОМА", "ВОДАХ", "СОСУД", "ЗНАКА", "БЛИНЫ", "ПАСТУ", "ПОЕЛИ", "ПАРКУ", "ТЕКУТ", "БИТЛЗ", "ПАУЗА", "МАТЬЕ", "МЕНТЫ", "ТЕЛЛИ", "ЙОНАС", "ОМАРА", "ТЕМПЕ", "ПОМОЙ", "КОРЕШ", "ТАРАН", "ПАПКИ", "СУКОЙ", "ШАРЛИ", "МЭТТА", "ДЭЙВА", "УЭЙНА", "АНЖЕР", "МАТТИ", "ВДОВЫ", "СОЖМИ", "УЭЛЛС", "СКАЧИ", "БЕЛКИ", "ШТУРМ", "МОРЕЙ", "АЙРЕС", "ШАССИ", "СТРОК", "ГРОМА", "ВИДЕН", "НОЖЕЙ", "БРОДИ", "БЕРТА", "СТАРЫ", "НУЖДА", "МАЛЫХ", "ЛИНЗЫ", "НАЛЕТ", "ЛЕВОМ", "ФИНЛИ", "БАРАК", "МОПЕД", "ФИШКИ", "РАНИТ", "ЛАСКИ", "ПЕСИК", "ЦЕЙТЛ", "ГЕНКО", "МАКГИ", "ФАЛКО", "ИКУКО", "МОРЕН", "АННОЙ", "КРЕЙН", "ЗЕРНА", "ДЕКАН", "ДОЧКЕ", "РОЗОЙ", "НОСОК", "ДУШНО", "СТАДА", "ПАСТИ", "ОБИДЫ", "ЗОВЕМ", "КОСОЙ", "ПЕРЦА", "МАННИ", "БОБОВ", "СНЯТЫ", "ДИКОМ", "ФРУКТ", "ТОМОМ", "БЛОКА", "БЛЭЙК", "ЯРКОЕ", "СУХАЯ", "ПЯТАМ", "ПОНГО", "ЖИВУЮ", "ШАЙЛО", "ПАХЛО", "ПИЗДА", "АТОМЫ", "ЛИББИ", "ЛОРИН", "ПИПЕЦ", "ПЯТОЕ", "ТЕПЛЕ", "ЯРКАЯ", "СБОРЫ", "ОПЫТЫ", "ЛЕНТА", "МЯТЕЖ", "ПОПЕЙ", "МЕЛЛИ", "БЕГАЮ", "БОЧКИ", "ТЕМОЙ", "БАНДЕ", "БОРЕЦ", "СИРОТ", "ТЯНУТ", "ЮНОГО", "СИНЕМ", "ЛАНЧА", "СЛЕПА", "ГОНОК", "ПОЛЕМ", "ВРЕЖУ", "НИЩИЙ", "УЧЁБУ", "МЕШКА", "ПУГАЙ", "ПАЧКИ", "СКРИП", "ДИЛЕР", "МОРИН", "БЬЕШЬ", "ТВИСТ", "ТЕВЬЕ", "ШАПКА", "РАВВИ", "СРАТЬ", "ФАКЕЛ", "ДАННИ", "ОЗЕРУ", "ТЯЖКО", "ПЕНИЯ", "ВИЛЛУ", "ЖИЛАХ", "ЛАВКА", "СНЕСУ", "ТРАУР", "ДИКИМ", "ПАДЁТ", "ВРАЛА", "ШКУРЕ", "ЩЕТКУ", "КРУГЕ", "КИНГА", "ГРОШИ", "СИНИМ", "ОТЕЛИ", "ОТЧИМ", "ДАВЯТ", "ПАПКА", "ГЕНОВ", "САВВА", "ПЬЕЛЬ", "ФАКСУ", "ДЖИМИ", "КАЮТУ", "КОСТА", "ШОФЁР", "ПРУДУ", "ТРОНА", "ТИХОЕ", "ШУТЯТ", "УМНОЙ", "ЗЛОБЫ", "РОТИК", "КАПОТ", "ПЕТЛЮ", "УСТАВ", "ДРОЖУ", "НАЯВУ", "ПАДЕТ", "ССУДУ", "МОЛЧУ", "КАПЛЮ", "ПАУКА", "СПИРТ", "ДЕЛЛА", "ЗАСЕК", "ИЗЫДИ", "ТОЛЩЕ", "ЮАНЕЙ", "БАРУХ", "ДЭББИ", "КЕРРИ", "КЭППИ", "ЯСУКО", "КИППИ", "БЭЛЛЬ", "СОЙЕР", "ПОЧЁМ", "ВЫБЬЮ", "ДРЯНИ", "ЛОВИЛ", "МЕШАЛ", "ЛЕГЛИ", "ТАНКА", "ДЗЮДО", "НАДУЛ", "БОЙЦА", "АКУЛУ", "УСТАХ", "МЭРИИ", "РИНГЕ", "КАССЕ", "ЛЕРОЙ", "БОЙНЮ", "ДЮБУА", "ПАУКИ", "КИСТЬ", "КОПЬЯ", "ЭЛЬЗА", "ХЭНКА", "ПЕПЛА", "СБОКУ", "ГАММА", "РОВЕР", "КИБУЦ", "САДИК", "СИНЮЮ", "НИКОМ", "БОСКО", "ДЗЫНЬ", "РЕГБИ", "СИЭТЛ", "СТРУН", "КАЛЛИ", "ЖУЧКИ", "ЭЛЬФЫ", "КОРКИ", "ШЛЮХЕ", "НИХУЯ", "ОУЭНС", "ТРЕНТ", "АСЛАН", "КРОФТ", "КОСКЕ", "ДАСЬЕ", "ЭТЕЛЬ", "ВКУСЫ", "ВЫМОЙ", "УЧЕБЕ", "ПИШЕМ", "САТИН", "ЧАСОК", "БАКСА", "СЛЕПЫ", "АБДУЛ", "МУШКЕ", "СКАЛУ", "АКИРА", "ТРУДЫ", "ФУТАХ", "УМЕЛА", "ИСКРА", "УЧИШЬ", "ОСЕНИ", "ДЕРЖА", "СЛОНЫ", "БЕЛОК", "ШАЙКА", "ЧАЙКУ", "КАРМА", "ВИЛЛЕ", "БОЯСЬ", "КАПУИ", "ДАВАЯ", "ЭНЖЕЛ", "ЖАЛЕЛ", "ДИКУЮ", "БЕРРИ", "ОТПАД", "ПИЖОН", "ВОНКА", "ЗВЕНО", "ВИЛКУ", "МАУРО", "ФИДЖИ", "БРОНЯ", "КОКЕР", "БЕЛЛЬ", "МОРРИ", "КАПУР", "ЯСМИН", "МЫЛОМ", "ХУАНА", "РЕБРО", "ТИРАН", "ОРЛОВ", "ЯЗЫКУ", "МАЙЕР", "МИЛЫХ", "НАЗЛО", "ТОПАЙ", "СОПЛИ", "СКОТЫ", "АЙРИН", "БОРТА", "МИЛУЮ", "ВЗЯТЫ", "ХУДАЯ", "ЧЕРЁД", "МЭЛЛИ", "РОЯЛЕ", "СЛАБЫ", "БЕНОМ", "ДИСКЕ", "СДАШЬ", "МАНЕР", "ТИХОЙ", "ПОЕЛА", "ХАКЕР", "ГОРАМ", "КОРСО", "ЦИФРУ", "ТИТРЫ", "ВОВСЮ", "РЕЖЕТ", "ВЕШАЮ", "ТРЕСК", "ШИМОН", "МУРАД", "ПРИНС", "КЛЯЙН", "ГУРНИ", "ПЕКИН", "РЫБОК", "ТУПОЕ", "ЛИВИЯ", "ДОРСИ", "ДЖЭМИ", "УИКЭМ", "СПОРА", "ТРОНЕ", "ДУШАМ", "ВИХРЬ", "УВОЛЮ", "ЦАРИТ", "КИСТИ", "УСАМИ", "ВОЮЮТ", "ТЕСЕН", "НАВЕК", "РУСЛО", "ОТВЁЗ", "ПИНКА", "БУДКЕ", "КАБАН", "ШАШКИ", "ЛОДОК", "ШИПИТ", "МЫШКА", "ХИТРО", "ВЗЛЕТ", "ПЕВЦА", "ЧУТЬЕ", "ЩЕНКИ", "МИЛАН", "НЕКОЕ", "СЕРЫЕ", "ФЛАНГ", "УЛЕЧУ", "БУДДЫ", "ПОЛИН", "УЖАСЫ", "ФОТКУ", "ПОТОП", "ПАСХУ", "МИСКУ", "СИРОП", "ВВЫСЬ", "ЛАЙЗА", "БОНУС", "РОЛЛА", "СЕУЛЕ", "ЗААВА", "ДОШЁЛ", "ПРАГЕ", "ЦВЕТЕ", "ЖИЛЕЦ", "БУФЕТ", "ВВЕДИ", "ТИГРЫ", "ВЫНУЛ", "БОЛЕЮ", "КОПАЙ", "ДИКОЕ", "ОСОБА", "МИССИ", "УБИТО", "ОБЕИМ", "ГОРЕМ", "ТАЛИИ", "БОССЫ", "ЮНИОН", "УХОДЕ", "ХИМИЯ", "НАЖМУ", "ЗАВЕТ", "ЧРЕВА", "СВЕЧА", "ТОЩИЙ", "ДРОБЬ", "ДАРУЙ", "СИРИИ", "КРЫЛЕ", "КЛЕРК", "КОВРЕ", "ИСКРЫ", "ПРАТТ", "ХАРУЭ", "РИНГО", "ПЛЯЖИ", "ГАЗОН", "МЕДИА", "ПИКАП", "ГУЛЯЙ", "ХИЛЛС", "ДИСКА", "МЭДДИ", "БИТОЙ", "УМНЫХ", "СИММС", "ТАММИ", "ДЖЕЕМ", "ПАЙКА", "РЭЧЕЛ", "НАОКИ", "СИМХА", "ХУЛИА", "РЕДДИ", "ФЛАГИ", "НАЙМУ", "ПОРОК", "ВИЛЛА", "ЯРКИМ", "ВОЛЕЙ", "КРАЖИ", "ХОЛЛА", "КОНГО", "САНТЫ", "АРБУЗ", "УЗАМИ", "СУММЕ", "ЗАЖГИ", "ОПОРА", "ЗАСЁК", "БУДКУ", "УСТАЮ", "ЗАМКУ", "РИГАН", "ХОГАН", "ОЖОГИ", "РОДИТ", "ФИЗИК", "ТРОПЕ", "ШКУРА", "ПЭТТИ", "СОЛЬЮ", "СУДЯТ", "КИШИТ", "АКЦИЯ", "ДУШКА", "СУПОМ", "ЖИБЕР", "ПОЛЮС", "ИЛЭЙН", "РОСТУ", "ЗАЖИМ", "ОТСОС", "БЕТСИ", "ТОСКУ", "ВИТЕК", "БОМБЕ", "МАТЬЁ", "ПАРКС", "ПИЗДУ", "ХЭДЛИ", "ПЕППИ", "ДАФНИ", "ДАУНС", "ЭЛИНА", "БЕККА", "ВЭРНИ", "ПЛИТУ", "УЖИНЕ", "ПАУЛЬ", "ЗАСНУ", "УЧИТЕ", "МАЛОЕ", "СЕРОЙ", "ЗАБИТ", "СЛУХА", "ТРЕТИ", "ЧИТАЯ", "ВОЗИЛ", "ЛАВКИ", "ГУДИТ", "МАЛЕЦ", "ВХОДУ", "ГАЗОВ", "НЯНЕЙ", "ТЯНУЛ", "БРАКИ", "НЕКУЮ", "КОЛЕС", "БОКОМ", "СОЮЗЕ", "ЗТОГО", "УХОДЯ", "КАДРА", "ДИЕТА", "АЛЛАН", "УБЕГУ", "ЧИСЕЛ", "МАНДА", "ПОЛИС", "НЕЕЕТ", "СВАЛИ", "ЛОРАН", "ЛЯЖЕТ", "БОУЛЗ", "БЭЙЛИ", "КОБРА", "ИЦХАК", "СЛУЖБ", "ЛУЗЕР", "ЙЕНТЛ", "КЕПКУ", "ДРАКО", "ЧХОЛЬ", "ТИЛНИ", "ХАДДО", "ТАЩИТ", "ОДЕНУ", "ЗЛИТЬ", "УЧЁБЫ", "КОЙКУ", "ПОРЫВ", "СБЕГУ", "НЕКОЙ", "ОБИЖУ", "НОСИК", "ЦАРЕЙ", "ЧУЖАЯ", "ЖАЛЕЙ", "РЫЖИЕ", "ДЕБЮТ", "ТОРЧУ", "ЛИЦАХ", "ТОННУ", "ЗАГАР", "ФРЕЙД", "ТЕТКА", "ВПОРУ", "КРАСС", "ЭДВИН", "БОЖЬИ", "ХАЙДЕ", "РАВЕН", "ТУПЫХ", "ЧАРЛЗ", "САЛЯМ", "КУЛОН", "САМКА", "КУИНН", "ЛУЧАХ", "ДИСКО", "ЗАФОД", "БРЭНД", "БРЮСА", "САГАН", "РЕНДИ", "ЛОРЕЛ", "КАЛЛЕ", "ЛОТТА", "ТРИПП", "КОРТО", "ЕИМАИ", "БУККА", "МАГДА", "ФЛАГА", "ХИМИК", "ЛОЖКА", "ОТГУЛ", "БАШЕН", "НЕСЛИ", "ПИРСА", "ПОНОС", "СЛЕЗУ", "СОЧЛИ", "ОСТЫЛ", "ЮНОШУ", "РЕЖУТ", "ПОРЕЗ", "БАЙКИ", "МАНИЯ", "ДАРЬЯ", "ЧУЖОЕ", "ГРОЗЫ", "БИЛЛУ", "ГОДЕН", "ШАРОВ", "БЫЛЫЕ", "ДРЕЙК", "ВИСЕЛ", "СЛОЕМ", "ПОВЁЛ", "БАБАХ", "ШЕПОТ", "РОССИ", "ВЫБИЛ", "ДОЙДУ", "РОДАХ", "БАРАХ", "НАЙДЯ", "РИТМЕ", "ЯГУАР", "ЛИТТЛ", "ГЕНИИ", "УЧЕБА", "ЭТИКА", "ОСЛИК", "БАНОК", "КЕЙДЖ", "СПИДА", "ХИКСА", "РОССА", "ТЕСЛА", "СЕСАР", "ИНАРА", "КАКВО", "МУКЕШ", "БУХТЕ", "СБАВЬ", "МАСЛУ", "ПОГАС", "ПОРТА", "КИОСК", "КРАНА", "ПОМЫЛ", "МЭММИ", "АРЕНУ", "УГРОЗ", "СМЕНЮ", "НАХАЛ", "ЭРИКУ", "ДЖИПЕ", "ПРОБУ", "ДЕРБИ", "ДЕЙВИ", "ГРЕБИ", "ШКУРЫ", "РОЛЬФ", "КАТОК", "КАНОЭ", "ГОЛЫХ", "ШУРИН", "СЧЕТЫ", "СОТРИ", "ОБЕДЕ", "ШКАЛЕ", "АРИАН", "МОКРО", "ЛОУРИ", "МЕДИК", "БРЕНТ", "ФОУЛИ", "БАРКА", "ПАЧКА", "РОЗЕН", "РУССО", "МАСОК", "МИРАЖ", "АКТОМ", "ДЭЙВИ", "БАБЛА", "ДЕДОМ", "ПЭТСИ", "РЭМБО", "ТЕСТЕ", "ДЖЕРИ", "ЗАЛЕМ", "КАИНА", "РЕНДЛ", "ВВЕДУ", "МЕНЯЙ", "ВАЛЛЬ", "ЛОВИМ", "КАШЛЯ", "СИНИХ", "ОДЕЛА", "СБРОД", "СЕДЛО", "УПРЯМ", "ГРУШИ", "ПЛЫВУ", "ТРОПА", "СЛАЩЕ", "ШУМИТ", "ТАУЭР", "СЫЩИК", "ПЯТЕН", "ХИТЕР", "НИЩИЕ", "ВЕЗЛИ", "РУЖЕЙ", "ЛИНДЫ", "ПЕКЛО", "СЕРАЯ", "ЛЕСОМ", "СУДОВ", "РЫДАЛ", "ШУМЯТ", "ЗДЕСЫ", "НАМЁК", "ПРОКУ", "ВДАЛЬ", "ПИЩЕЙ", "НЕГРА", "ОБРЕЛ", "АСТМА", "ЛАПКИ", "ЛИФТЫ", "ПОРВИ", "ОМЕГА", "ВОЮЕМ", "ЛЕТАЮ", "ПЛЮНЬ", "МОГИЛ", "ЧЕХОВ", "ТЕЛОК", "КЛАЙН", "ХАЙДИ", "СЕТЬЮ", "БУДКИ", "ТЕЛКУ", "ДОНОР", "ЧТОЛИ", "АВНЕР", "ААААА", "СХЕМЫ", "КУЛЬТ", "ЧЕРРИ", "ПИДЕР", "СТЕЙН", "КИНСИ", "УИМЕТ", "АЛЖИР", "ВОБЩЕ", "ГЕОРГ", "ЗАЙЦА", "ВОПЛИ", "ОБЩИМ", "РУЧЬЯ", "ОПИУМ", "БРАКУ", "ПОДАЮ", "МЕТКА", "БЛОКЕ", "ОПЕКИ", "СВЯЖИ", "СУЕТЫ", "ЛЖЕЦЫ", "ЩЕТКА", "ДАНИИ", "СКЛОН", "РАВНА", "ВЕНОК", "ГУДКИ", "ЛЕВША", "ЛЕВЫМ", "КУМИР", "ПОЛЗИ", "ХИМИЮ", "ВИСЯТ", "БОНДА", "ГИББС", "ЗАВЁЛ", "РОНДА", "КРЕМА", "ГАИТИ", "ЭТАПА", "ЛОРДУ", "ПОПКУ", "РИНГА", "ЗЕБРА", "ЗЕВСА", "КЛЕЙН", "КУЭЙД", "ИТАНА", "РИЧЧИ", "ХАННЫ", "ГАДЕС", "ТАЛЬЯ", "СЕКСУ", "СФЕРЫ", "АТЛАС", "ПРАХУ", "ОСЛОМ", "КАРЛУ", "УВОЛЬ", "ПАСУЙ", "ХЛАМА", "БЛОКИ", "ТОНКО", "АФИНЫ", "ГОНИТ", "ДОБЫЛ", "ПЬЁТЕ", "УВЕЗИ", "УГЛАМ", "СШИЛА", "ВЕСНУ", "БЭНКС", "БИЛСЯ", "БЕДНЫ", "ЛИКЕР", "КОМИК", "ИЛОНА", "ОПРОС", "ГИДОМ", "ЗУБКИ", "ПЛАЧА", "ПЬЕРА", "ФОРТЕ", "МОНТЕ", "МРАКЕ", "ЧЕДЖУ", "ЖАКЕТ", "ОРЕШЬ", "ПОЯСЕ", "КЛЫКИ", "РЕЧЕЙ", "БИНТЫ", "ЕЗДИМ", "БЫВАЙ", "АМАЛЬ", "ГОЛЛИ", "ФАУСТ", "БЕТОН", "ЦЕНИЛ", "БАБЛО", "ЛИВАН", "МЕТАЛ", "ВЫШЛЮ", "САМЦА", "ЕБАЛО", "РОКЕР", "ЮРГЕН", "ВЭНДИ", "ПИЩИТ", "КЛИФФ", "КИМБЛ", "БУМЕР", "ОСВИН", "КВИНН", "ЙОССИ", "БОРАТ", "ЗИППО", "МОЛБИ", "ЧАНДЭ", "ЛИЛИИ", "ЧЕКОВ", "БЕРИТ", "ЭПОХА", "ТОШНО", "ВОЛЬФ", "РОБЕР", "БЬЁШЬ", "КОМОК", "ПЯТУЮ", "КОРМА", "УЕДУТ", "СПЭЙД", "ТАНКЕ", "МОРДЫ", "ВЕТВИ", "ЧИСЛУ", "СДАЕТ", "ПАСХИ", "ЮВЕНЬ", "ЛЕНИН", "ОЩУПЬ", "НЕСЕМ", "ЛОКТИ", "РИТМА", "ЛЕВЫХ", "СОКОМ", "ГАЛЛИ", "ЛИШЕН", "ХИТОМ", "ДЕВОЙ", "ЛИЦАМ", "СУНУЛ", "СВЕЛО", "УДРАЛ", "ВЫСОК", "ЛЕТИЕ", "СТРОГ", "КОЛЕН", "ПЛЕЧА", "СМЕНЕ", "ПЛАВУ", "ТЕСТО", "ПЕНСА", "СОФИИ", "УМЕЛИ", "ТЫКВЫ", "ТУНЦА", "СЕТКУ", "БАБОЙ", "ДОЖИЛ", "СЕУЛА", "СХЕМЕ", "КУБКА", "ЯЩИКУ", "ОПИШИ", "ПЕПСИ", "ЗАХОД", "ЛЮПЧЕ", "МАЛАЯ", "КЭЙТИ", "ИНОУЭ", "ЛЕЧАТ", "КОЛОЙ", "ССАТЬ", "ПИЗДЫ", "ЙЕРУН", "СПИРС", "ПЕРОН", "ШАСТА", "ЙОХЕН", "ТАРИК", "УКОЛЫ", "ССОРЕ", "ТЕСТЬ", "ГУБИТ", "СПОЕМ", "ИАКОВ", "КАССА", "ХУПЕР", "РИСОМ", "ГУСЕЙ", "ГЛЯНУ", "ПОМРУ", "ПЛИТЕ", "ГОРОХ", "ОТБОЯ", "ОЛЕНИ", "НЕМЦА", "БЕСЕД", "РАНЯТ", "ПЛАЩЕ", "НЕМАЯ", "ХУАНГ", "БРЕНД", "ЛАДИМ", "СГИНЬ", "ДОЙЛА", "ЗАДАЧ", "ПАРИС", "ЮЖНЫХ", "СЫРОЙ", "ТОРТЫ", "КРЫЛА", "БОКСА", "АЛЬДО", "ЛИДИИ", "ШАГАЛ", "ГОРКИ", "САЙКС", "ТЕКЛА", "МЕММО", "ПАВЛА", "ЗАБЫВ", "РАЙНО", "ЦВЕТУ", "ВЕРХА", "ДАМБЫ", "ФИГНИ", "НОЖИК", "РУНГЕ", "СДАЮТ", "КАПУТ", "ВЪЕЗД", "МИРТЛ", "УТЕРА", "АЛЕНА", "ПОСОХ", "БРЭДА", "РВОТА", "АРАКИ", "ЭКСЛИ", "РИВКА", "САМИР", "КАРАС", "БОРНА", "ФАРИК", "МЮНЦЕ", "ТУРКИ", "СУЧИЙ", "ЛЕОНА", "ХРАБР", "ПАСТЫ", "ДЫШАТ", "ССОРУ", "СШИТЬ", "ПОМОЮ", "ЧЕКОМ", "ТАЛИЯ", "ПОЧВЫ", "МЕССЫ", "КОВРЫ", "ОАЗИС", "СЛЭЙД", "СОШЛО", "ГНИДА", "ФОТКА", "ОБРЕЗ", "ПОЕТЕ", "АЛЛЕЕ", "СВОЖУ", "ЛЬВОМ", "ЯЙЦОМ", "СВЕЖО", "ПЛЯЖУ", "ДЖАЗА", "ГОРЛУ", "ПОЭМУ", "КЕКСЫ", "ЭТИКИ", "ЧУЕШЬ", "ВЕТКА", "ЧУЖОМ", "ПОРТЬ", "ПЛИТЫ", "ПУТАЮ", "САСКЕ", "ЭЛЕНА", "ТЮРЕМ", "ФОНДЫ", "РАДЖА", "ПЬЕРО", "БОЖИЯ", "БОЖЬЮ", "ДОВЕЛ", "СУХИМ", "ФРЕНД", "ВИЛКА", "КОМБО", "ДЗИНЬ", "ЦАРЕМ", "ПИВЭР", "МАЯКА", "ТОРГИ", "ПЫЛЬЮ", "ТЁЛКА", "СИРИЛ", "КУРЦА", "ЯВНЫЙ", "ПРАЙМ", "ОДЕТТ", "АНГАР", "ТРАВМ", "МАМАН", "ГЕВИН", "ДАЙНА", "КИПУР", "ДЭРРИ", "КЕЙПА", "ЛОТСО", "ВВОЖУ", "БИРЖА", "БРЕДА", "СЕДЛЕ", "РОЛЕЙ", "КУРТА", "ВЫСОТ", "КОТЯТ", "СПОЁМ", "ШПАНА", "МЕНЯЛ", "ДЕЛИМ", "ВЫТРУ", "МИЛЕЕ", "КОЙКЕ", "ДАМАМ", "ДАВЛЮ", "КОНЯМ", "ВДОВУ", "ОКНАХ", "РЮМКУ", "ВРЕТЕ", "МУКОЙ", "ПЭДДИ", "НАЙЛЗ", "УЛИКУ", "ОПЕКУ", "МИЛЛС", "СТОРИ", "БЬЫТЬ", "ЕРЕСЬ", "МАЛЫЕ", "ЗАИКА", "ПОРЧУ", "ЛАЯТЬ", "ПАРУС", "БАЛДА", "ТРОЖЬ", "БАРДО", "ОРГИИ", "ДИЕТЫ", "СТОЯК", "МОЧОЙ", "СПАЗМ", "СИНАЙ", "СЕЛИЯ", "ЛЕОНИ", "ПЕШКА", "НАВОЗ", "БОКСЕ", "СИСКО", "ХИЗЕР", "ДЖОША", "ПУМБА", "ОЛИМП", "КУДЖО", "НАЛЛА", "ПАНКИ", "ПЛЮСЫ", "УМНОЕ", "КОМАР", "ТОЛКА", "УГЛОВ", "СЪЕЗД", "НЕКИЕ", "ВОПИТ", "УИЛКС", "ГАДКО", "ЗАПРУ", "ГОРЕЛ", "МАРКЕ", "КАРИЕ", "ДЫШИМ", "ПОЙНТ", "РЕШАЛ", "ГОНЯТ", "ЛЕФТИ", "СУХОЕ", "ГРЕЕТ", "ТЕЛАХ", "НЕСЛА", "ОДЕЛИ", "СЯДУТ", "ЛИТРА", "ОБУЗА", "УНЦИЙ", "ЭРНСТ", "ДОЛГЕ", "ФУДЗИ", "МОРЗЕ", "ДЫШАЛ", "КИРБИ", "ДОРИН", "ОТНЕС", "КРИКА", "ЛЯЖЕМ", "МАЖОР", "МОНИК", "ОТКОС", "ПАРИТ", "СВЯТО", "ПОПАВ", "ВИТТИ", "ФАЙЛА", "ПЕТРИ", "ОПОРЫ", "РОЛАН", "ГАЗУЙ", "СВАМИ", "ОБЪЕМ", "ПЕТЛИ", "СЛЕПО", "СОСНЫ", "АПАЧИ", "СТЕПИ", "ШТУББ", "ЮЖНЕЕ", "ЛУЧЕЙ", "АСТЕР", "ПОПКИ", "ЛАМАР", "ТЁЛОК", "ДЕБРА", "ПАЗЗЛ", "АВЕЛЬ", "МАРИН", "АЛОХА", "ДЖИНИ", "ГОТЭМ", "НАНДО", "МАНСИ", "БЛЕЙД", "ЭННИС", "ТЭЛЛИ", "ЧИАКИ", "ЛОУИС", "ВРАЛИ", "МАТКИ", "КОРМЕ", "ЦИКЛА", "БРОНЬ", "ОБЫЩИ", "ГЛИНЫ", "ЭТЬЕН", "ДЫРОК", "ДЫБОМ", "ВОЛЕН", "КРАШЕ", "НАВЁЛ", "ВЕЧНА", "ДОНОМ", "МАШЕТ", "РЕЙСЫ", "РАНГА", "СУЛИТ", "КНЯЗЮ", "ЗВУКУ", "ВЫЕЗД", "ИНДЮК", "МЕССЕ", "ДАРЯТ", "КУРИЦ", "ЗЛЫМИ", "ТРЯСИ", "ЛИСТЫ", "УЗКИЙ", "СИЯТЬ", "ЯСНЫМ", "ОРАНЖ", "УРОНИ", "ПЕСКИ", "ТАЩИЛ", "ПУТАЙ", "МАЙКЕ", "ФОРТА", "МАРЬЯ", "СИГАР", "УМЕЛО", "РИСТО", "ХРАМУ", "ОБРЫВ", "ЗАЕЛО", "ЗЕБРЫ", "ПСИНА", "СТРАЖ", "ЧЛЕНУ", "ЛИНДУ", "ЧАЙКИ", "ГОРИМ", "ДЯТЕЛ", "ЖЕРОМ", "ПЛАТО", "ИУДЕИ", "СПЕША", "РУЛЕТ", "ГОРАН", "СТИЛЮ", "АКЦИЮ", "ПОРШЕ", "КОДОМ", "БОННО", "ХЭЗЕР", "ЛОРНА", "ЛАТТЕ", "УИННИ", "КАЙЛИ", "ЗОРРО", "АПХЭМ", "ТЕЙЛС", "ХЭЗЭР", "МЕНДИ", "ТАПИА", "СКАЛИ", "ЛМНЦС", "ДОБРЕ", "ЛЭЙХИ", "ТУРОП", "СИРЕН", "ВЕРФИ", "ДУРЬЮ", "БРЕШЬ", "ЙОРКУ", "КЕПКА", "СРЫВА", "КОШКЕ", "ПОБЬЮ", "БОЧКА", "ЮБКОЙ", "НАЧАВ", "ЧАШКЕ", "ОСЛОВ", "ГОРЯЧ", "БАШКИ", "УКУШУ", "СОФЬЯ", "МЕЧЕЙ", "ДЫМОМ", "СМОЕТ", "ХАРПО", "СРОКЕ", "ВИНИТ", "КЛАРЫ", "РАЛЛИ", "СДАСТ", "ЖИРОМ", "РОЙАЛ", "ВЕСЛА", "ШАПКИ", "ЛИМИТ", "СЕКТЫ", "ТРОПУ", "МАХАЛ", "БАНДИ", "ПРЯЧЬ", "ПЕРДИ", "ИЗВНЕ", "РОУЗИ", "ДРЕВО", "МЕДОМ", "КИСКУ", "ФРАЕР", "СЛЮНА", "КРАБЫ", "ХОЛЬМ", "СБРИЛ", "ПЁРСИ", "МЕТКИ", "ЛЭНГА", "ТАППИ", "СУРКА", "БАЗЗА", "НАСЕР", "ЭНОЛА", "АСТРО", "СТИВО", "КОКСА", "ЛИНЧА", "ПАДМЕ", "СЭНДС", "ПЕРИС", "ДЭРИН", "СИССО", "БЛЕЙР", "ХЭММИ", "КИОХА", "ПОЖАЛ", "РЕКСА", "ВЕТВЬ", "ЦЕПЬЮ", "ВДОВЕ", "ТУПУЮ", "ДОЛЕЙ", "ШАРОМ", "ЭЛМЕР", "САРАЯ", "ОБИДЕ", "СЕРОМ", "ПТИЦЕ", "ВЕТКУ", "НЕЖЕН", "МРАЗИ", "ШАПКЕ", "МЫШКИ", "ПЕЧКУ", "МАКСУ", "ТВОРЮ", "СЛУГУ", "ПЛЫЛИ", "СНЯТА", "БОЧКЕ", "ДУЛОМ", "ОПУЩУ", "ДРОЖИ", "НИТКУ", "БУНТА", "ВЕРСТ", "МЕЛКО", "МОЩНО", "ПАНЧО", "НУЖДЕ", "КУЧКУ", "ШУТИМ", "УНЯТЬ", "ГЕРОЮ", "ЯЙЦАХ", "НИСИМ", "КУЗОВ", "ЗАТЕЮ", "ХРЮША", "АЛЕТТ", "ОТРЫВ", "СИНГЛ", "ПАДЛА", "КУПЯТ", "ЮЖНЫЕ", "СОУСЕ", "ХАКИМ", "ХОЧЕШ", "ПЕСАХ", "ВЫШИБ", "РЕШИВ", "ОТВАР", "ГРИЛЬ", "СЕЙТА", "ИЛАНА", "ЧЛЕНЕ", "БАББА", "ЯНГЕР", "СОСУТ", "СИНКЕ", "ПАУЛУ", "РИГГЗ", "КЭРОН", "ГРЭДИ", "КИРИЕ", "ТАНТО", "САЛЕХ", "ЭРДЖИ", "СВАРЮ", "БАЗОЙ", "ПОРКИ", "ЦИНИК", "УПУЩУ", "БЕССИ", "СВИНГ", "ВВОДИ", "БЕСЯТ", "ПРУДА", "ТУФЛЮ", "РЫВОК", "ВИШНИ", "НАРДЫ", "ВЕЗЕМ", "КАИРО", "ИСТЕК", "КЛУБУ", "БРОНЮ", "ПРИДЯ", "ЯРКОЙ", "СКРЫЛ", "УКУСИ", "ХИЛЛЗ", "КОСМО", "СВОДИ", "СЭРОМ", "ПОМЕХ", "КОЛЕИ", "ЧУЖАК", "ДВОРУ", "СЧЁТЫ", "ТОНИК", "СОДОМ", "ЛОТОС", "КОРМИ", "ВОЮЕТ", "ГЭВИН", "МЕССА", "ЦЕПЕЙ", "ОПЛОТ", "СМЕХУ", "КОКНИ", "РУДЬЕ", "СБРОС", "БРЮХО", "СОЮЗУ", "ПАУЛЫ", "БЫТИЕ", "ПРЫЩИ", "НОЖКА", "БЕГАЙ", "РОЖЕЙ", "УБЪЕТ", "КРЭЙГ", "СЧЁТУ", "ТОЧНЫ", "ДЕЙЛИ", "ТИПАЖ", "КЕРСИ", "НЮМАН", "КОТОМ", "КАДЕТ", "НИККЕ", "ПЛЕЕР", "КАОРИ", "ХЁРЛИ", "ДАЯНА", "СТАРР", "ХОЛЬЦ", "АДЛЕР", "МОЖЕШ", "КЕЛСО", "КИТОН", "ЧЕЧНЕ", "СУИНИ", "ОУКЛИ", "АЙАЛА", "БЕЛЛЫ", "ДЖЭФФ", "НУНИК", "ЁРШАН", "ХЭШИН", "НАНГА", "ЖОРЖА", "ИЗДАЛ", "ДОЗОР", "ФРИЦЫ", "ДЛИНЫ", "ШЛЕМЫ", "ОТВЕЛ", "ФУРИЯ", "ПУДРА", "КРАСЕ", "РЯДОВ", "РЕЙНА", "ЛИФТУ", "ЗНАЧУ", "ФАРГО", "КОНГА", "КРИЧА", "СОТНЕ", "ДОВЁЛ", "НАВЕЛ", "ВЕЛЛИ", "ОУЭНА", "ВЕТРЫ", "ВЕНАХ", "СКУКУ", "ОБВАЛ", "ВОРУЮ", "ГОРДЫ", "ТОЩАЯ", "СЕЯТЬ", "АНДЗЮ", "БЛИСС", "КИЕВА", "ЭЛТОН", "ГИЕНЫ", "ПЫТАЛ", "НЕЖНА", "БАРОМ", "КИШАТ", "ЖЕСТЫ", "ЖАРЧЕ", "ПОЧКА", "УМОРА", "ПОКОИ", "КРЭЙН", "ШТАМП", "ПОЛОВ", "АРЕНЫ", "ВАДИМ", "ХОКАЙ", "КВИНА", "БЫКОМ", "ЯСНАЯ", "СДЕСЬ", "ЦВЕЛА", "ГОЛАН", "МОЩЬЮ", "МАКЕТ", "НОВАК", "ПЭГГИ", "ШАБАТ", "АМИНА", "МЭРРИ", "РЖАТЬ", "БОМОН", "МЕТКУ", "БЫЧИЙ", "НИЦШЕ", "ЭЙПОН", "АХМАД", "ПЭРИС", "СИБИЛ", "БРАИН", "ДЭНИС", "КАРЕВ", "КОФФИ", "ВУРСТ", "РОУДС", "САДЫК", "ОЙРАН", "МИСОН", "МАТЕИ", "ТРУПЕ", "ОБРЁЛ", "ШУМОМ", "ПЕРОМ", "ДРАМУ", "ШАРМА", "БЛЕЙН", "РЕЙЛИ", "СУХИХ", "МУЗЕИ", "ЩЕДРЫ", "ГУСТО", "ДОЗАХ", "САЛУН", "ЗАГОН", "КАПРИ", "ЗАБЫТ", "ТРЕЗВ", "ВЕСЕЛ", "ОСОБЫ", "ЦАРЁМ", "МЕРИЛ", "СУМОК", "ВЕКАХ", "ФИШЕК", "ПАПКЕ", "ВОПЛЬ", "ПЛОДА", "МИРАХ", "РЕШЕН", "ПРИЗА", "КОЙКИ", "КЛЮЧЕ", "ПАДУТ", "УВОДИ", "ТАРИФ", "УБЕДИ", "РЕЗНИ", "САБЛИ", "НОСИМ", "ДУШЕМ", "СОТРУ", "КОТЕЛ", "ЛИЗОЙ", "ТРОИМ", "АТЛЕТ", "ПОЙЛО", "БЛОХИ", "ТАКТА", "ЖИЗНЫ", "МЕТТИ", "РУБЕЖ", "НИЩИМ", "РОЖОК", "ИГРАМ", "САЙТО", "ПЕЩЕР", "СПЕЛА", "МУЧИТ", "ФОНДУ", "ДИАНУ", "ДАЛЕК", "АЛКАШ", "ТАИТИ", "ЗАЖМИ", "ХРАМЫ", "ГЛИНА", "ИВРИТ", "САДОВ", "БЬЮИК", "ГЛЮКИ", "ГАШИШ", "ПИДАР", "КАФКА", "АРЛИН", "УВЕЗУ", "ГАДОВ", "ВИНТА", "СЕТКИ", "МАЛУЮ", "ЛЕВИН", "РАМОС", "СВЕЛИ", "БУХТЫ", "ВОЖАК", "ХАСОН", "СОСЕТ", "ВОЗМИ", "МАРША", "ЙОРАМ", "НУРИТ", "РЕВЕТ", "РЕЗАК", "СОСОК", "МАУНТ", "БЕРИЛ", "ТЭРРИ", "СЕГУН", "ЗАВИС", "ХЕРНЕ", "СТЭНА", "ФУЛЕР", "ЧАНГА", "ТИТАН", "МОЗЛИ", "БУРЫЙ", "БАШИР", "УОРДА", "КРОТА", "ДИДЬЕ", "ХАШЕМ", "ЛЭНДИ", "СИГНЕ", "МИРИТ", "КАБЕИ", "ТОБЕИ", "ДАНДО", "НАЙВС", "ХАУСА", "СКРЫТ", "УЁБОК", "АЛЬБА", "АМБАР", "СМЕЮТ", "РОКОМ", "ЗАЛИЛ", "КОРНЮ", "УНЕСИ", "ДЖОЗИ", "ЗАЕЗД", "ДУШАХ", "ТИХИЕ", "НАГЛО", "УВЕЛА", "СОСЁТ", "КЕНТА", "ИРВИН", "УСПЕВ", "СУРОВ", "ДЫРОЙ", "РОСЛО", "ГОРДА", "ТИРАЖ", "ДЖИПА", "КРИВО", "РЕЗАЛ", "ПИТЬЕ", "ПЛИТА", "СЁДЗИ", "КАЮТА", "НАБИТ", "ПОДЛЕ", "ЛАПАХ", "КРАЯМ", "ПОНЯВ", "МОЕШЬ", "БУДИТ", "СЫРУЮ", "ДРУЖУ", "ТАБОР", "СЕТЕЙ", "ПЕВЦЫ", "ТРЮМЕ", "ПОЧКУ", "ГЛАСС", "МАРТУ", "ДЕТОК", "ТИНОЙ", "СУЩАЯ", "УГОРЬ", "НИЧЕЙ", "БОЛЕЙ", "ЧАКРЫ", "ОРЕХА", "ТОНЕМ", "МАМКА", "СОСАЛ", "ЛОМАЮ", "ДАВИЛ", "МУЧИЛ", "ШНАПС", "ФЕЛПС", "ГУЧЧИ", "ЖИЛОЙ", "ТЫКВА", "СЛИЗЬ", "ХЕРШИ", "ХРУСТ", "ОРИОН", "САМКИ", "ШАРЛЯ", "МУЧАЙ", "ЗНАЕШ", "СТУКА", "ШЕРОН", "ГУБКА", "ДРЕЛЬ", "ХАОСЕ", "ЛЭНДО", "КОСТЯ", "КОРАН", "МАХОМ", "ПАРАХ", "МАККИ", "БАМПИ", "ХАДЖИ", "САЛЕМ", "ХОГГЛ", "ЭНСИН", "НЮХАЙ", "СЛИТЬ", "АРЛЕН", "МАКФИ", "ЭШТОН", "ЛАПАЛ", "ТИМОН", "АНВАР", "ХАМАС", "МЕТТЕ", "МИКРО", "СУККУ", "РИТОН", "ОТОМО", "МАРЛА", "ОТАРИ", "ЛИЛЛИ", "ЦТОБЫ", "ЧЭНДУ", "МИНТЦ", "САНТЕ", "ВИНИЛ", "ТРИКО", "ШЛЮЗА", "ИРИНА", "СВЯЖУ", "УЧЁБЕ", "УКУСА", "УДАЧЕ", "МОРГА", "ТРУСА", "УЛОЖИ", "ДОИТЬ", "СМЕРЧ", "ВЫМОЮ", "МУМИЯ", "КИСКИ", "ШЕЛКА", "ВЕСНЕ", "РЕЗНЮ", "ЗЛОБА", "ЯРЛЫК", "РОМОМ", "ЛУИСЕ", "ЗЯТЕМ", "КОНЕК", "ДЭНОМ", "ВОШЛО", "СТРЕЛ", "РОЛЬЮ", "АРМАН", "ЛИНДЕ", "РЕНТУ", "КОКОС", "БРОЖУ", "БРЕЙК", "ЯРКИХ", "БЕДРЕ", "КОЙОТ", "САЖАЙ", "СОНЕЙ", "БАРИН", "МУКАХ", "ДЖЕЙС", "СЛЮНЫ", "ВЕРДИ", "СКУЛЫ", "ДУШИТ", "ГУЛЯШ", "ПЛАЗЕ", "ДОЕДУ", "ИЗГИБ", "ДИАНЫ", "ЩЕТКИ", "БУЛКИ", "БАДДА", "ЛИСТЕ", "БОИСЬ", "ПОЭТЫ", "СКЛЕП", "ДОКАХ", "ПАРКИ", "ВХОДЫ", "НУЖДУ", "БОРОВ", "САИДА", "СЕДАН", "КРАЛИ", "ПУТЯХ", "ДЮРАН", "МАССЕ", "ПОУЗИ", "ХАГЕН", "ОФИСЫ", "УОТТС", "РАМКУ", "КРИСУ", "АКТОВ", "РВАЛО", "ЗЕЛЬЯ", "КАНТО", "ФИГУР", "БЕРНЕ", "КАБАК", "РАШИД", "РЕМНЯ", "ФИШКУ", "АББАТ", "МЕДЕЯ", "БУХЛО", "ТЁЛКИ", "ГРУЩУ", "ЛОМАЛ", "КЕЙНА", "СОФИЮ", "ЖЕСТЬ", "НИНОЙ", "ЛАКИЙ", "ВИЛМА", "МИШКУ", "ЙОНОИ", "ВАРДО", "АУДИО", "ЛЕЧИЛ", "РТУТЬ", "МОДЖО", "БЭЙБИ", "БЕЛКУ", "ОРОШО", "УШИБЫ", "НУРИЯ", "АНИМЕ", "ГРЭМА", "СПИДИ", "БЕГИН", "РАЙЯН", "СЭЙДИ", "БИВИС", "ХАННУ", "ВЕСЛИ", "БАФФИ", "КЕРБИ", "ЭЙДЕН", "МЕРДЕ", "ЯЮЙЮЛ", "ТЕРИН", "БУТЧИ", "НАНАЭ", "ЮСТЕС", "ПАЛЫЧ", "БРЕДУ", "ВЫЙДЯ", "ПОЭМА", "ТЮФЯК", "КОПЫТ", "МЫЧИТ", "УТКОЙ", "ВАХТУ", "ДОЕШЬ", "ХОРСТ", "ОРАЛА", "ХМЫРЬ", "НАЛЁТ", "МУЗЕЮ", "ГРУБА", "ПОЁТЕ", "КОЗЛУ", "БИЛЛЬ", "БУРНО", "ШЁПОТ", "ГРУДЫ", "ЧУЛАН", "ГРИМА", "ЖЕНАМ", "ЦЕННО", "ХВАЛУ", "ТЬМОЙ", "МЫШЦУ", "ЛАМОН", "АЙЗЕК", "ОСАДЕ", "ЛУЧОМ", "УЗКАЯ", "СУФЛЕ", "ОСЛАБ", "ЗЛОБУ", "ДЖЕФА", "СЕДЫЕ", "ДОНЬЯ", "КАКЖЕ", "РОВНЯ", "БЬЫЛО", "АСТМЫ", "БЕКЕР", "СТУЧИ", "УГОНЕ", "КУМАР", "НРАВУ", "РИМОМ", "СОЙДИ", "ПРИЗЫ", "БЕГУН", "ВАЛИТ", "УГЛАХ", "ЧЕРТЕ", "ШЕЛБИ", "ЛЕВЫЕ", "НЕЧЁТ", "КОПЬЁ", "ССУДЫ", "МИНОР", "БРАНИ", "ШТЕРН", "ИТОГИ", "РАЗУЙ", "БЕДЕР", "ЙЕППЕ", "ГНИЕТ", "ВЫНОС", "СБОРУ", "ПИНОК", "ТАБЛО", "КОЛЬТ", "ГЭРРИ", "ШАЙКУ", "ЛАКОМ", "ДУДКУ", "НОЕШЬ", "ЦЗИНЬ", "СУЧЕК", "ГАНСА", "МЫТЬЯ", "ДОРФФ", "СЛОЕВ", "ШЛЕМЕ", "ПАЧЕК", "ГНОМЫ", "СТРИП", "КАКТЫ", "АФЕРЫ", "ЛОПЕЗ", "УСИКИ", "ИРАНЕ", "СЕКТА", "БЕСОВ", "ЯИЧКО", "БОЛОТ", "АКБАР", "МАДДИ", "СПОКА", "УХУРА", "ЩИТОВ", "МСАБУ", "ДРУИД", "ДАРТС", "ДАРЕН", "ВЕРДЕ", "СУХУЮ", "ЛАУРИ", "САНТУ", "СПРЕЙ", "ВОНГА", "СКУБИ", "КОДОВ", "ГАРЕТ", "АРМОР", "ДАСТИ", "ПИВЦЫ", "НОЭРУ", "САННА", "КАССИ", "МЕДДИ", "ВЭННА", "ТАДАС", "РОМЕК", "УСАМА", "КРИДИ", "ФАКЕР", "ГЙБФЯ", "ХЕДЛИ", "ПИППО", "НАФТА", "НАВИД", "РОТТИ", "МУМУМ", "РОМЕН", "БУРЕЙ", "ЛИШЁН", "КЛАРУ", "УПЛЫЛ", "АБЗАЦ", "ЩИПЦЫ", "ОТБИЛ", "ПАЛАС", "РЫНКИ", "ТЯГАЧ", "КЛЮЁТ", "ТИСКИ", "МЕТКО", "АЖУРЕ", "КРАЁВ", "ТЕМНА", "ГРИНА", "ПУГАЛ", "ГРЕМП", "МЫЛСЯ", "МИЛОМ", "МИННИ", "МЕТИТ", "КРАДУ", "ЛАДЯТ", "БРОШЬ", "ПИЦЦА", "ПЛАТЕ", "GGGGG"];

    commonWords = ["ЗДЕСЬ", "ЧТОБЫ", "КОГДА", "МОЖЕТ", "ОЧЕНЬ", "БУДЕТ", "ДАВАЙ", "НУЖНО", "ЛАДНО", "ВРЕМЯ", "ДУМАЮ", "ТОГДА", "ТОБОЙ", "ЛУЧШЕ", "МОЖНО", "МНОГО", "ТАКОЙ", "ВСЕГО", "ХОТЕЛ", "ЖИЗНЬ", "ПОТОМ", "ЧЕРЕЗ", "ТАКОЕ", "ПОСЛЕ", "ЗАЧЕМ", "НИКТО", "ЖИЗНИ", "НАЗАД", "ВИДЕЛ", "ТОЧНО", "ЛЮБЛЮ", "КАКОЙ", "ЛЮДЕЙ", "ДОМОЙ", "СКАЖИ", "ПРОШУ", "БУДЕМ", "СНОВА", "МЕСТО", "МОЖЕМ", "ПОШЛИ", "ХОЧЕТ", "РАЗВЕ", "ПРЯМО", "СВОЕЙ", "ДУМАЛ", "ЗНАТЬ", "ПОНЯЛ", "ЗНАЕТ", "НАЙТИ", "МОЕГО", "БУДУТ", "СТОИТ", "ЗОВУТ", "ПЕРЕД", "НУЖЕН", "ВЕРНО", "СКОРО", "ПУСТЬ", "БОЛЕЕ", "ТАКАЯ", "НУЖНА", "ТАКИЕ", "КАКАЯ", "САМОМ", "РАВНО", "МИНУТ", "ТВОЕЙ", "МОГЛИ", "ПОЧТИ", "МОГУТ", "СОБОЙ", "СКАЖУ", "ПЛОХО", "ДВЕРЬ", "ДАВНО", "ДЕНЕГ", "ГЛАЗА", "БУДТО", "МЕЖДУ", "ПОЙДУ", "ОПЯТЬ", "САМОЕ", "ДЕТЕЙ", "ГОТОВ", "НОМЕР", "СВОИХ", "РЯДОМ", "ТАКИМ", "МЕСТЕ", "ДОЛГО", "КРОМЕ", "НАШЕЙ", "ВЧЕРА", "ДРУГА", "НУЖНЫ", "КАКИЕ", "СМОГУ", "СРАЗУ", "СВОИМ", "МОГЛА", "ВРОДЕ", "ОДНОЙ", "ВЕЧЕР", "ВЗЯТЬ", "СЛОВА", "ВАЖНО", "ПОМНЮ", "НОЧЬЮ", "УТРОМ", "БОЮСЬ", "ТАКЖЕ", "САМЫЙ", "СПАТЬ", "СТАТЬ", "ИНАЧЕ", "СЛОВО", "НОВЫЙ", "ЧАСОВ", "ЗНАЕМ", "КОНЕЦ", "ПРАВА", "ГОРОД", "ПАРНИ", "ЗНАЛА", "НАШЛИ", "ПОШЕЛ", "ИМЕЕТ", "ЧАСТЬ", "ХОТЯТ", "ЧУВАК", "ДАЙТЕ", "ЖДАТЬ", "ЗАТЕМ", "ЛЮБИТ", "ТАКИХ", "РЕШИЛ", "МЕСТА", "ПАРНЯ", "ВДРУГ", "МАДАМ", "КАКОЕ", "ФИЛЬМ", "ДЕРЖИ", "ЗАБЫЛ", "ПОЗЖЕ", "МИЛАЯ", "ТЫСЯЧ", "ДЕЛАЛ", "КОНЦЕ", "МИЛЫЙ", "ДОБРО", "ЛЮБВИ", "ЧЕСТЬ", "ДЕЛАЮ", "ШЕСТЬ", "ЧАСТО", "ЗНАЮТ", "СЕМЬЯ", "УХОДИ", "ОКОЛО", "ЛЕГКО", "ДЕЛАЙ", "ХОТИМ", "ИМЕТЬ", "ШКОЛЕ", "МАЛЫШ", "СЫНОК", "СТАЛО", "ЗНАЛИ", "ВЫЙТИ", "ЛЮДЯМ", "ОГОНЬ", "ДЕТКА", "СРЕДИ", "МУЖИК", "ОТВЕТ", "ЛЮБОЙ", "ИМЕНИ", "УЛИЦЕ", "УБИЛИ", "ЕХАТЬ", "ГОЛОС", "МЕСЯЦ", "САМАЯ", "КОНЦА", "ИДИОТ", "УЗНАЛ", "ВСЕМУ", "УДАЧИ", "СЕМЬИ", "ПРАВО", "СТАЛА", "СЛЫШУ", "ВЕСТИ", "СВЯЗИ", "БРОСЬ", "БРАТА", "КРУТО", "ПОКОЕ", "ЛЮБОМ", "СЛАВА", "ЗЕМЛИ", "ВЫБОР", "ДЭВИД", "РАДИО", "НОВЫЕ", "ШКОЛЫ", "ВИДНО", "НИКАК", "НОВАЯ", "МЫСЛИ", "СВЕТЕ", "НАРОД", "ОБЩЕМ", "ВОВСЕ", "ТАКСИ", "ЧЕРТА", "КУПИЛ", "ЧАСТИ", "ЦЕЛЫЙ", "ВЕЧНО", "ПОЕЗД", "ВВЕРХ", "СВЯЗЬ", "КНИГИ", "ЖЕНОЙ", "ПОПАЛ", "КЛЮЧИ", "БЛИЖЕ", "ЗАНЯТ", "ВВИДУ", "СМЫСЛ", "ЛИЧНО", "УСТАЛ", "МЕНЕЕ", "УХОЖУ", "ВЫХОД", "ВЫШЕЛ", "АДРЕС", "ДУРАК", "СВЕТА", "БОЙСЯ", "ЗЕМЛЯ", "ВЕЗДЕ", "ГЛУПО", "ПРОЧЬ", "КЛАСС", "ВЕЩЕЙ", "ПОЛНО", "СОВЕТ", "ЗАКОН", "МЫСЛЬ", "АГЕНТ", "УБЕРИ", "ВОЙТИ", "ДОЖДЬ", "КНИГА", "ВЫШЛА", "ПЕСНЯ", "ВЗЯЛА", "ЛЕГЧЕ", "САМЫХ", "ДУМАЙ", "БЕЛЫЙ", "КУРСЕ", "ШУТКА", "ПЛАНЫ", "ЦВЕТЫ", "ВОЙНУ", "ЦЕНТР", "ВЫШЛО", "УВИЖУ", "ЖЕЛАЮ", "ЧИСТО", "МОЗГИ", "КУСОК", "УКРАЛ", "БИЛЕТ", "БОЛИТ", "ВЕТЕР", "ПРИЕМ", "ДЕЛОМ", "ИСКАЛ", "ВИДИТ", "ГОСТИ", "ГЕРОЙ", "ВНОВЬ", "ДЕРЖУ", "БРАТЬ", "СЗАДИ", "ВОЗЛЕ", "УЛИЦУ", "СИДИТ", "КАРТЫ", "ЗАЙТИ", "СОТНИ", "СТРАХ", "МЕЧТЫ", "СУДЬЯ", "ШКОЛА", "УМЕЕТ", "ПРОЩЕ", "ЦЕЛУЮ", "МАЙОР", "БРАВО", "ЛЕЖИТ", "ФОРМЕ", "ЗАМОК", "ЛИНИИ", "ШТАНЫ", "СЕСТЬ", "ИСЧЕЗ", "ИМЕНА", "ПРИНЦ", "ЛЮБОЕ", "СУПЕР", "БОЛЕН", "ПОМНИ", "СНИМИ", "ПЕСНИ", "КОСТИ", "ЦВЕТА", "МЁРТВ", "УМНЫЙ", "ИГРАЮ", "ВЕДЕТ", "ЖЕНАТ", "СОШЕЛ", "МУЖЕМ", "ПАЛЕЦ", "МЕЧТА", "ТОЧКИ", "СТЕНЫ", "ОТДАМ", "СХОЖУ", "ВЫЙДУ", "РОВНО", "СТОЯТ", "ЛЮБИМ", "ЖАРКО", "НОВЫМ", "ЖДАЛИ", "АНГЕЛ", "СЛУХИ", "ОТДЕЛ", "ГЕНИЙ", "ПЛАЧУ", "РАНЕН", "ЖДАЛА", "ПУСТИ", "ОТЕЛЕ", "ШЕРИФ", "РОМАН", "КУПЛЮ", "ХОДИТ", "ИЩЕШЬ", "ХОДЯТ", "СЛЕДЫ", "СЛЕВА", "СУМКУ", "ГОРЛО", "МИРОМ", "СТЕНЕ", "БОМБА", "СОРОК", "НИГДЕ", "ЗВОНИ", "ТОВАР", "КАРТУ", "ВОДОЙ", "СЦЕНУ", "ОФИСЕ", "ВРАЧА", "СИЛОЙ", "КУХНЕ", "СПИНУ", "ПОЙМИ", "ЧИСЛО", "СОБАК", "КЛУБЕ", "СТОЯЛ", "САМУЮ", "ДАЛЕЕ", "СТОЛЕ", "ВИДЕО", "БОРТУ", "ВЕРНИ", "ГРУДИ", "ПИШЕТ", "СЧЕТА", "СЛЕДИ", "ОСОБО", "ТУПОЙ", "ЗВОНЮ", "ВЫПЕЙ", "ЛЕТОМ", "ЦЕЛЬЮ", "ЖАЛКО", "ДВОРЕ", "ВЫШЛИ", "ЛЕВОЙ", "АВТОР", "СТИЛЬ", "СЦЕНЕ", "ВОЛОС", "ГЛАВА", "ТОЧКА", "ЖДИТЕ", "ПИРОГ", "УСПЕЛ", "ВЫЗОВ", "РАЗУМ", "БЕЛЫЕ", "ЖИВОТ", "ПТИЦА", "КАРТА", "ПЛАЧЬ", "ВЫРОС", "ГРЕЙС", "СОШЛА", "ЗВАТЬ", "СТЕНУ", "ВЕРИТ", "УСПЕХ", "СЕВЕР", "ЕЗЖАЙ", "ЗАКАЗ", "ШОССЕ", "ПРИЁМ", "БАНКА", "ПАРКЕ", "ИТОГЕ", "ЯЗЫКЕ", "МАШИН", "ДРЯНЬ", "КАМНИ", "ВЗРЫВ", "ОБЕДА", "ТАНЕЦ", "ВРАТЬ", "ТУФЛИ", "НАЧНУ", "ДОБРЫ", "ХРЕНЬ", "ПОЖАР", "ПОШЛО", "ХВОСТ", "ЭТАЖЕ", "РЕДКО", "ЦЕЛАЯ", "СИЛАХ", "ШТАТА", "ТЕПЛО", "МОЛЧИ", "ТВАРЬ", "ГОРИТ", "МУСОР", "ПОЙМУ", "ТОЛПА", "ПУШКУ", "ФУТОВ", "ШТУКИ", "СЕЗОН", "НОСИТ", "ВХОДИ", "УРОКИ", "ПИЦЦА", "ОРДЕР", "УДАЧА", "НОЧАМ", "УЧИТЬ", "НОРМЕ", "ОБРАЗ", "УПАЛА", "ЗВЕРЬ", "ВЕРИЛ", "КЛУБА", "ТЕАТР", "ВИРУС", "КАНАЛ", "ЖЕРТВ", "ПОЗОР", "ГОСТЬ", "ДОЧКА", "КРИКИ", "ВРАГА", "ТОЛКУ", "ЗАПАД", "БОМБЫ", "ВЫПИЛ", "ВЫЙДИ", "КОЗЕЛ", "СОСЕД", "УЛИЦА", "ВЫЖИЛ", "ПОКОЙ", "ОТЧЕТ", "БАНКЕ", "ПАКЕТ", "ШАНСЫ", "СИНИЙ", "ОТРЯД", "МЕШОК", "ВСТАЛ", "БЕРЕТ", "ПУТЕМ", "ОБМЕН", "ПРИМИ", "ДОБРА", "РАЗОК", "ЧИТАЮ", "ТАНЦЫ", "ЛЕТИТ", "ТАЙНА", "ЛОДКУ", "ПОВОД", "ЗВУКИ", "ВРЕДА", "ОКЕАН", "ГРЕХИ", "КРЫШУ", "ПАЦАН", "КРЫШЕ", "ВРАГИ", "НЕСТИ", "МОЛОД", "ВЕРЯТ", "ВОЛНЫ", "БРАУН", "МЕТРО", "ИГРАЙ", "КОНЦУ", "БАДДИ", "ЛОДКА", "МАСЛО", "ТЕМНО", "НЕРВЫ", "СЦЕНА", "КРЫСА", "СОЙТИ", "САННИ", "СУДНО", "ФАКТЫ", "ШЕСТИ", "РАНЕЕ", "ТОЧКУ", "ПОРОЙ", "ВАННУ", "РАЙОН", "ЧЛЕНЫ", "ВРАЧИ", "МОТОР", "ИГРОК", "САЙТЕ", "ЭФИРЕ", "РЫНОК", "ПУНКТ", "РАСТИ", "БЕЛЬЕ", "ГРЯЗЬ", "ЖЕНИХ", "КОШКА", "ПОЛОН", "УМНАЯ", "ПЛЯЖЕ", "СТИХИ", "ЛГАТЬ", "ТРУСЫ", "КУСКИ", "РОБОТ", "ЖУТКО", "ВЕТРА", "СДАТЬ", "УЛИКИ", "ВЕЛЕЛ", "НЕБЕС", "ОБОИМ", "ОЗЕРО", "ПЛОТЬ", "РЫНКЕ", "КРЕСТ", "КУЗЕН", "ОБУВЬ", "ТЕЛОМ", "ВИЗИТ", "НАУКА", "СЕРИЯ", "ДЫШИТ", "ЮЖНОЙ", "ДОМИК", "БОГОВ", "ПАСТЬ", "СОШЁЛ", "НАНЯЛ", "СУДЬИ", "ПРИМУ", "ЛИДЕР", "СУТКИ", "ТАЙНЫ", "БЕРЕГ", "САЛАТ", "КЛЕВО", "ПЕСОК", "ПОИСК", "ВРЕШЬ", "САХАР", "ПИЛОТ", "ЮНОША", "ЦЕНОЙ", "МУЗЕЙ", "ЗВЕЗД", "БРЮКИ", "ШАНСА", "БЛЮДО", "НОСОМ", "БАНДА", "ОХОТА", "КРЫША", "ПОВАР", "ОПЫТА", "ВЛЕВО", "ДОЛГИ", "ТРУДА", "АВЕНЮ", "МЕСТЬ", "ЗАЛОГ", "ПОКОЯ", "РУЧКУ", "ЮМОРА", "КНЯЗЬ", "ФОКУС", "АРЕСТ", "СТВОЛ", "ТРУПЫ", "ДОЖДЯ", "ЦЕЛОМ", "СОТЕН", "ЧУЖОЙ", "АКЦИИ", "РАНЧО"];

    if(localStorage.getItem('everWon') != 'true'){ //if you've never won wordle, display the rules on page load
        rulesScreenToggle();
        localStorage.setItem('totalPlayed', 0);
    }

    let secondsAtEnter = 'invalid';

    let now = new Date();
    let year = now.getFullYear();
    let month = now.getMonth()+1; 
    let day = now.getDate();
    let currentDate = day.toString() + month.toString() + year.toString();
    let currentUSDate = month.toString() + '/' + day.toString() + '/' + year.toString();
    var startDate = '01/01/2022';

    function parseDate(str) {
        var mdy = str.split('/');
        return new Date(mdy[2], mdy[0]-1, mdy[1]);
    }

    wordleNumber = Math.round( (parseDate(currentUSDate)-parseDate(startDate))/(1000*60*60*24) );

    let lastSaved = localStorage.getItem('lastSavedDate'); //load this data if same day
    if(parseInt(lastSaved) == parseInt(currentDate)){
        for(i = 0; i<30; i++){ 
            let thisThing = eval('"letter' + i.toString() + '"'); //loading letters
            $(eval('"#' + thisThing.toString() + '"')).text(localStorage.getItem(eval('"' + thisThing +'"')));
            $(eval('"#letter' + i.toString() + '"')).addClass(localStorage.getItem(eval('"color' + i.toString() + '"'))); //loading colors
        }
        
        type = localStorage.getItem("type"); //loading type
    
        if(type == null){
            type = 0;
        } // end loading type

        if(localStorage.getItem('finishedToday') == 'true'){ //if you already won today, display the stats screen
            winScreenToggle();
            $('#bottomPartPopup').removeClass('hide');
        } else {
            $('#bottomPartPopup').addClass('hide');
        }

    } else { //load this data if different day
        for(i = 0; i<30; i++){ 
            let thisThing = eval('"letter' + i.toString() + '"'); //delete saved letters
            localStorage.removeItem(eval('"' + thisThing +'"'));
            
            localStorage.removeItem(eval('"color' + i.toString() + '"')); //delete loaded colors
        }
        
        localStorage.removeItem('type');
        localStorage.setItem('finishedToday', false);
        type = 0; 
        $('#bottomPartPopup').addClass('hide');
    }

    function updateStatsInfo(){
        if(Number.isInteger(parseInt(localStorage.getItem('totalWon'))) == false){ //total won
            localStorage.setItem('totalWon', 0);
            localStorage.setItem('lastWonDate', 0);
        }
    
        if(Number.isInteger(parseInt(localStorage.getItem('totalLost'))) == false){ //total Lost
            localStorage.setItem('totalLost', 0);
        }

        if(Number.isInteger(parseInt(localStorage.getItem('currentStreak'))) == false){ //current Streak
            localStorage.setItem('currentStreak', 0);
        }

        if(Number.isInteger(parseInt(localStorage.getItem('maxStreak'))) == false){ //max Streak
            localStorage.setItem('maxStreak', 0);
        }

        if(Number.isInteger(parseInt(localStorage.getItem('lastWonDate'))) == false){ //max Streak
            localStorage.setItem('lastWonDate', 0);
        } else {
            var daysAgoPlayed = Math.round( (parseDate(currentUSDate)-parseDate(localStorage.getItem('lastWonDate')))/(1000*60*60*24) )
            if(daysAgoPlayed > 1){
                localStorage.setItem('currentStreak', 0);
            }
        }

        totalWins = 0;
        for(i=1; i<=6; i++){
            currentGuessTotal = 'guess' + i;
            if(Number.isInteger(parseInt(localStorage.getItem(currentGuessTotal))) == false){ //check if it's a number
                localStorage.setItem(currentGuessTotal, 0);
            }  
            var totalWins = totalWins + parseInt(localStorage.getItem(currentGuessTotal));
            $(eval('"#statsBar' + (i-1) + '"')).text(parseInt(localStorage.getItem(currentGuessTotal)));
        }

        for(i=1; i<=6; i++){
            currentGuessWidth = 'guess' + i;
            currentGuessWidth = parseInt(localStorage.getItem(currentGuessWidth))
            currentGuessWidth = currentGuessWidth/totalWins;
            currentGuessWidth = currentGuessWidth*365;
            currentGuessWidth = Math.round(currentGuessWidth);

            if(currentGuessWidth >= 8){
                currentGuessWidth = currentGuessWidth + 'px';
            } else {
                currentGuessWidth = 'auto';
            }
            $(eval('"#statsBar' + (i-1) + '"')).css('width', currentGuessWidth);
        }

        if(Number.isInteger(parseInt(localStorage.getItem('totalPlayed'))) == false){ //total played
            localStorage.setItem('totalPlayed', 0);
        } else {
            var percentage = (parseInt(localStorage.getItem('totalWon')))/(parseInt(localStorage.getItem('totalPlayed')));
            percentage = percentage*100;
            percentage = Math.round(percentage);
            $("#winPercentNum").text(percentage);

            $("#playedNum").text(localStorage.getItem('totalPlayed'));
            $("#currentStreakNum").text(localStorage.getItem('currentStreak'));
            $("#maxStreakNum").text(localStorage.getItem('maxStreak'));
        }
        
    
    }


    const theLettersHere = ['Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'Ё','Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю'];
    const keyboardOrder = ['Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'Ё','Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', '0', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '0'];
    for(i=0; i<32; i++){
        localStorage.setItem(theLettersHere[i], 'nothing');
    }

    updateStatsInfo();
    updateKeyColors();


    //END OF LOADING INFO
    function updateKeyColors(){
        for(i=0; i<29; i++){
            let currentColor = localStorage.getItem(eval('"color' + i.toString() + '"'));
            let currentLetter = localStorage.getItem(eval('"letter' + i.toString() +'"'));
            let actualPlace = keyboardOrder.indexOf(currentLetter);
            if(currentColor == 'green'){
                $(eval('"#keyLetter' + actualPlace.toString() + '"')).removeClass('yellow');
                $(eval('"#keyLetter' + actualPlace.toString() + '"')).removeClass('black');
                $(eval('"#keyLetter' + actualPlace.toString() + '"')).addClass('green');
                localStorage.setItem(currentLetter, 'green');
            } else if(currentColor == 'yellow' && localStorage.getItem(currentLetter) != 'green'){
                $(eval('"#keyLetter' + actualPlace.toString() + '"')).removeClass('black');
                $(eval('"#keyLetter' + actualPlace.toString() + '"')).addClass('yellow');
                localStorage.setItem(currentLetter, 'yellow');
            } else if(currentColor == 'black' && localStorage.getItem(currentLetter) != 'green' && localStorage.getItem(currentLetter) != 'yellow'){
                $(eval('"#keyLetter' + actualPlace.toString() + '"')).addClass('black');
            }
        }
    }

    function addDelay(letter, seconds){
        let position = keyboardOrder.indexOf(letter);
        $('#keyLetter' + (position).toString()).css('transition-delay', (seconds/2.5 +'s'));
    }

    var startTime = new Date();
    let hour = 23 - startTime.getHours();
    hour = String(hour).padStart(2, '0')
    let minute = 59 - now.getMinutes();
    minute = String(minute).padStart(2, '0')
    let second = 59 - now.getSeconds(); 
    second = String(second).padStart(2, '0')
    let time = hour + ':' + minute + ':' +  second;
    $('#countdownTimer').text(time);
    
    setInterval(function(){ //every second
        var now = new Date();
        let hour = 23 - now.getHours();
        hour = String(hour).padStart(2, '0')
        let minute = 59 - now.getMinutes();
        minute = String(minute).padStart(2, '0')
        let second = 59 - now.getSeconds(); 
        second = String(second).padStart(2, '0')
        let time = hour + ':' + minute + ':' +  second;
        $('#countdownTimer').text(time);
    }, 1000); 

    //CSS START
    let height = $(window).height();
    $('#popup').css('height', height);

    $( window ).resize(function() {
        let width = $(window).width();
        let height = $(window).height();
        $('#popup').css('height', height);
    });

    var bMobile =   // will be true if running on a mobile device
    navigator.userAgent.indexOf( "Mobile" ) !== -1 || 
    navigator.userAgent.indexOf( "iPhone" ) !== -1 || 
    navigator.userAgent.indexOf( "Android" ) !== -1 || 
    navigator.userAgent.indexOf( "Windows Phone" ) !== -1 ;

    if(bMobile == 'true') {
        alert('You are viewing this website on a mobile device. It is not optimized for mobile and I would suggest switching to a computer.');
    }

    //END CSS

    function hashAlgorithm(day, month, year) {
         let randomNum = [1324, 1692, 839, 786, 26, 219, 648, 1343, 1169, 1905, 1723, 189, 645, 608, 892, 1634, 1286, 382, 800, 547, 556, 960, 1576, 428, 1043, 654, 333, 1636, 1805, 1838, 1985, 1289];

        let number = month*year;
        number = number + day;
        number = number*randomNum[month*2];
        number = number - (randomNum[day]*day);

        while(number<0){
            number = number + randomNum[day];
        }

        while (number>commonWords.length){
            number = number - commonWords.length;
        }

        return number
    }

    number = Math.floor(Math.random() * (commonWords.length));
    // let wordOfTheDay = commonWords[number];
    let wordOfTheDay = commonWords[hashAlgorithm(day, month, year)];
    const alphabet = 'АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯяGg';
    let word = '';

    function updateHTML(type, word, store){
        for(i=0; i<5; i++){
            let myCurrentLetter = parseInt(type) + i;
            if(word.slice(i, i+1) != ''){
                $("#letter" + myCurrentLetter.toString()).text(word.slice(i, i+1));
            } else {
                $("#letter" + myCurrentLetter.toString()).html('&nbsp;');
            }
            if(store == true){
                localStorage.setItem(eval('"letter' + myCurrentLetter.toString() +'"'), $("#letter" + myCurrentLetter.toString()).text());
                let now = new Date();
                let year = now.getFullYear();
                let month = now.getMonth()+1; 
                let day = now.getDate();
                let fullDate = day.toString() + month.toString() + year.toString();
                localStorage.setItem('lastSavedDate', fullDate);
            }
        }
    }

    function capitalizeRussian(letter){
        index = alphabet.indexOf(letter);
        if(index % 2 == 1){ // if lowercase
            letter = alphabet[index-1];
        }
        return letter;
    }

    //POPUP SCREENS
    localStorage.setItem('statsScreen', false);
    localStorage.setItem('winScreen', false);
    function winScreenToggle(){
        var statsScreen = document.getElementById("statsScreen"); //yes i know it's not jQuery for some reason $('#container') does not work so that
        statsScreen.classList.toggle("hide");
        if(localStorage.getItem('statsScreen') == "true"){
            localStorage.setItem('statsScreen', false);
        } else {
            localStorage.setItem('statsScreen', true);
        }


        //Setting all the screen values
        updateStatsInfo();
    }

    document.getElementById("close").addEventListener("click", rulesScreenToggle);
    document.getElementById("rules").addEventListener("click", rulesScreenToggle);
    document.getElementById("stats").addEventListener("click", winScreenToggle);

    function rulesScreenToggle(){
        var popup = document.getElementById("container"); //yes i know it's not jQuery for some reason $('#container') does not work so that
        popup.classList.toggle("hide");
        if(localStorage.getItem('winScreen') == "true"){
            localStorage.setItem('winScreen', false);
        } else {
            localStorage.setItem('winScreen', true);
        }
    }

    $('#shareButton').click(function() {
        shareBoxes = 'Wordle ' + wordleNumber + ': ' + localStorage.getItem('currentGuessesToday') + '/6 \n';
        for(i=0; i<(localStorage.getItem('currentGuessesToday')*5); i++){
            if(i%5 == 0){
                shareBoxes = shareBoxes + '\n';
            }
            currentShareBoxColor = localStorage.getItem(eval('"color' + i +'"'));
            if(currentShareBoxColor == 'green') {
                shareBoxes = shareBoxes + '🟩';
            } else if(currentShareBoxColor == 'yellow'){
                shareBoxes = shareBoxes + '🟨';
            } else if(currentShareBoxColor == 'black'){
                shareBoxes = shareBoxes + '⬛';
            }
        }
          navigator.clipboard.writeText(shareBoxes);
          $("#shareButton").text('Copied!');
          setTimeout(function(){ //every second
            $("#shareButton").text('SHARE');
        }, 3000); 
    });

    function enterWasPressed(){
        let now = new Date();
        let year = now.getFullYear();
        let month = now.getMonth()+1; 
        let day = now.getDate();
        let currentUSDate = month.toString() + '/' + day.toString() + '/' + year.toString();

        if(localStorage.getItem('finishedToday') != 'true') {
            let valid = false;
            if(word.length != 5){
                alert('Please enter a five letter long word.');
            } else{
                for(i=0; i<fiveLetters.length && valid==false; i ++){
                    current = fiveLetters[i];
                    if(word == current){
                        valid = true;
                    }
                }
                if(valid == false){ //what happens if the word is invalid
                    alert(word + " is an invalid word. Try again.");
                } else { //what happens if you get a valid word
                    updateHTML(parseInt(type), word, true);
                    pastYellow = 0;
                    for(i = 0; i<5; i++){
                        let totalNumber = parseInt(i) + parseInt(type);
                        realLetter = wordOfTheDay.slice(i, i + 1);
                        guessLetter = word.slice(i, i+1);
                        addDelay(guessLetter, i);
                        $("#letter" + (totalNumber).toString()).css('animation-delay', ((i.toString()/3) +'s'));
                        $("#letter" + (totalNumber).toString()).css('animation-duration', '.75s');

                        if(guessLetter == realLetter){ // Green Start
                            $("#letter" + (totalNumber).toString()).addClass('green');
                            localStorage.setItem(eval('"color' + totalNumber + '"'), 'green');//Green End
                        } else if(wordOfTheDay.includes(guessLetter)){ //Yellow start
                            let guessInstances = 5 - (word.replaceAll(guessLetter, '')).length;
                            let realInstances = 5 - (wordOfTheDay.replaceAll(guessLetter, '')).length;
    
                            if(guessInstances <= realInstances){
                                $("#letter" + (totalNumber).toString()).addClass('yellow');
                                localStorage.setItem(eval('"color' + totalNumber + '"'), 'yellow');
                            } else { 
                                totalGreenAndPastYellow = 0;
                                totalGreen = 0;
                                for(j = 0; j < 5; j++){
                                    let yellowGuessLetter = word.slice(j, j+1);
                                    let yellowRealLetter = wordOfTheDay.slice(j, j+1);
                                    let amount = parseInt(type) + parseInt(j);
                                    if(yellowGuessLetter == guessLetter){
                                        if(yellowGuessLetter == yellowRealLetter){
                                            totalGreen ++;
                                        }
                                    } 
                                }
                                totalGreenAndPastYellow = totalGreen + pastYellow;
                                if(realInstances>totalGreenAndPastYellow){
                                    $("#letter" + (totalNumber).toString()).addClass('yellow');
                                    localStorage.setItem(eval('"color' + totalNumber + '"'), 'yellow');
                                    pastYellow ++;
                                } else {
                                    $("#letter" + (totalNumber).toString()).addClass('black');
                                    localStorage.setItem(eval('"color' + totalNumber + '"'), 'black');
                                }
                            } //Yellow End
                        } else {
                            $("#letter" + (totalNumber).toString()).addClass('black');
                            localStorage.setItem(eval('"color' + totalNumber + '"'), 'black');
                        }
                    }

                    if(word == wordOfTheDay){ //what happens if you get the word right
                        $('#bottomPartPopup').removeClass('hide');
                        localStorage.setItem('lastWonDate', currentUSDate);
                        setTimeout(() => {  
                            localStorage.setItem('finishedToday', true);
                            localStorage.setItem('everWon', true); //everFinished
                            localStorage.setItem('totalPlayed', (parseInt(localStorage.getItem('totalPlayed')) + 1)); //total played
                            localStorage.setItem('totalWon', (parseInt(localStorage.getItem('totalWon')) + 1)); //total won

                            if(type == 0){ //won on which guess
                                localStorage.setItem('guess1', (parseInt(localStorage.getItem('guess1')) + 1));
                            } else if(type == 5){
                                localStorage.setItem('guess2', (parseInt(localStorage.getItem('guess2')) + 1));
                            } else if(type == 10){
                                localStorage.setItem('guess3', (parseInt(localStorage.getItem('guess3')) + 1));
                            } else if(type == 15){
                                localStorage.setItem('guess4', (parseInt(localStorage.getItem('guess4')) + 1));
                            } else if(type == 20){
                                localStorage.setItem('guess5', (parseInt(localStorage.getItem('guess5')) + 1));
                            } else if(type == 25){
                                localStorage.setItem('guess6', (parseInt(localStorage.getItem('guess6')) + 1));
                            }

                            localStorage.setItem('currentGuessesToday', ((type/5) + 1));

                            let currentStreak = localStorage.getItem('currentStreak');
                            let maxStreak = localStorage.getItem('maxStreak');
                            currentStreak = parseInt(currentStreak) + 1;
                            localStorage.setItem('currentStreak', currentStreak);
                            if(currentStreak > maxStreak){
                                localStorage.setItem('maxStreak', currentStreak);
                            } else {
                                localStorage.setItem('maxStreak', maxStreak);
                            }
                            winScreenToggle();
                        }, 2000);
                    } else {
                        if(parseInt(type)>=25){ //what happens if you run out of guesses
                            setTimeout(() => {  
                                alert('You lose :( The wordle was ' + wordOfTheDay); 
                                winScreenToggle();
                            }, 2000);

                            $('#bottomPartPopup').removeClass('hide');
                            localStorage.setItem('finishedToday', true);
                            localStorage.setItem('everWon', true); //everFinished
                            localStorage.setItem('totalPlayed', (parseInt(localStorage.getItem('totalPlayed')) + 1)); //Total Played
                            localStorage.setItem('totalLost', (parseInt(localStorage.getItem('totalLost')) + 1)); //Total Lost
                            localStorage.setItem('currentStreak', 0); //reset current streak
                            localStorage.setItem('currentGuessesToday', 'X');
                        } else {
                            type = parseInt(type) + 5;
                            localStorage.setItem('type', parseInt(type));
                            word = '';
                        }
                    }
    
                    
                }
            }
            updateKeyColors();
        }
    }

    function newKey(letter){
        if(alphabet.includes(letter) && word.length <5){ //what happens when a valid letter key is pressed
            letter = capitalizeRussian(letter);
            word = word + letter;
            updateHTML(type, word, false); // this is where updateHTML is being called from
        }
    }

    document.addEventListener("keydown", function(event) {
        let letter = event.key;
        if(letter == 'Backspace'){
            if(localStorage.getItem('finishedToday') != 'true'){
                word = word.slice(0, -1);
                updateHTML(type, word, false);
            }
        } else if (letter == 'Enter') {
            var timeAtEnter = new Date();
            secondsAtEnter = timeAtEnter.getSeconds(); 
            enterWasPressed();
        } else{
            newKey(letter);
        }
    });






        //BEGINNING OF THE REPETITIVE CODE AHHHHHH DON'T LOOK AT THIS IF YOU WANT TO KNOW HOW TO WRITE GOOD CODE
        $('#key0').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Й';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key1').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ц';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key2').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'У';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key3').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'К';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key4').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Е';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key5').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Н';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key6').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Г';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key7').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ш';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key8').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Щ';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key9').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'З';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key10').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Х';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key11').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ъ';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key12').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ё';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key13').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ф';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key14').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ы';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key15').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'В';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key16').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'А';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key17').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'П';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key18').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Р';
                newKey(letter);
            } else{
                console.error('Prevented Serious Error');
            }
        });

        $('#keyLetter19').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'О';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key20').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Л';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key21').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Д';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key22').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ж';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key23').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Э';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key24').click(function() {
            enterWasPressed();
        });
    
        $('#key25').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Я';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key26').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ч';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key27').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'С';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key28').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'М';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key29').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'И';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key30').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Т';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key31').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ь';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key32').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Б';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key33').click(function() {
            let timeAtClick = new Date();
            let secondsAtClick = timeAtClick.getSeconds(); 
            if(secondsAtClick != secondsAtEnter && secondsAtClick != (secondsAtEnter + 1)){
                let letter = 'Ю';
                newKey(letter);
            } else {
                console.error('Prevented Serious Error');
            }
        });
    
        $('#key34').click(function() {
            if(localStorage.getItem('finishedToday') != 'true'){
                word = word.slice(0, -1);
                updateHTML(type, word, false);
            }
        });
});

